{
  "1": {
    "choices": [
      {
        "nextEntry": "previousEntry",
        "text": "Return to your last location"
      }
    ],
    "description": "He’s lying.",
    "traceNumbers": ["166", "177"]
  },
  "2": {
    "description": "The room is silent. You feel about for the light switch. You find it, and gently press it on. Oops! It’s Mrs. Harding’s room! What a mistake! You see her turn and rise from the bedclothes, her frightened face screaming. As the scream pierces your ears, you hear the boarders begin to stir. The residents are coming! But what’s focusing your attention is the shotgun Mrs. Harding is reaching for. You’d better run!",
    "traceNumbers": ["52"],
    "choices": [
      {
        "nextEntry": "Arkham Location",
        "text": "Escape!"
      }
    ]
  },
  "3": {
    "choices": [
      {
        "nextEntry": "Arkham Location",
        "text": "Withdraw Cash",
        "requirements": {
          "character": "Professor Grunewald"
        }
      },
      {
        "nextEntry": "Arkham Location",
        "text": "Finish at bank"
      }
    ],
    "description": "Deposits and withdrawals are possible between 9-3. M-F. If you’re Prof. Grunewald, your account is here, and you can withdraw up to the Cash amount noted on the investigator sheet.",
    "title": "ARKHAM FIRST NATIONAL BANK",
    "traceNumbers": ["Arkham Location"]
  },
  "7": {
    "description": "The window opens smoothly, and you enter. You try to move as quietly as possible.",
    "choices": [
      {
        "effects": {
          "check": {
            "failure": "51",
            "skill": "Stealth",
            "success": "7a"
          }
        },
        "nextEntry": "51",
        "text": "Try to run past the man"
      }
    ],
    "traceNumbers": ["28", "90"]
  },
  "8": {
    "description": "He takes your refusal without interest. 'Very well, sir. I shall return later.' He leaves and you stare at the walls of your silent room.",
    "choices": [
      {
        "text": "Move on a day",
        "nextEntry": "187",
        "effects": {
          "setHour": 23,
          "advanceTime": 6
        }
      }
    ],
    "traceNumbers": ["167"]
  },
  "9": {
    "description": "The man is an Egyptian. His posture seems threatening.",
    "choices": [
      {
        "text": "Try to run past the man",
        "nextEntry": "10",
        "effects": {
          "check": {
            "skill": "Dodge",
            "failure": "10",
            "success": "10f"
          }
        }
      }
    ],
    "traceNumbers": ["47"]
  },
  "10": {
    "title": "Confrontation",
    "description": "Attempt a DEX roll:",
    "choices": [
      {
        "text": "Attempt a DEX roll to preemptively act",
        "effects": {
          "check": {
            "skill": "DEX",
            "success": "10a",
            "failure": "10b"
          }
        }
      }
    ]
  },
  "11": {
    "description": "Before you enter, you sense something beyond the door. Putting your ear to the door, you listen.",
    "choices": [
      {
        "text": "Listen",
        "nextEntry": "141"
      }
    ],
    "traceNumbers": ["52"]
  },
  "12": {
    "description": "Food poisoning! You’re really sick! Make a successful Constitution roll and go on your way, or, if the Constitution roll is failed, spend three hours recovering, and lose 1 hit point.",
    "choices": [
      {
        "text": "Make a CON roll",
        "effects": {
          "check": {
            "skill": "CON",
            "success": {
              "description": "You recover quickly and go on your way.",
              "nextEntry": "New York"
            },
            "failure": {
              "description": "You spend three hours recovering and mark off 1 hit point.",
              "advanceTime": 3,
              "modifyHealth": -1,
              "nextEntry": "586"
            }
          }
        }
      },
      {
        "text": "Go to any New York Location",
        "nextEntry": "New York",
        "requirements": {
          "currentLocale": "New York"
        }
      },
      {
        "text": "Go to any Athens Location",
        "nextEntry": "Athens",
        "requirements": {
          "currentLocale": "Athens"
        }
      },
      {
        "text": "Go to any Egypt Location",
        "nextEntry": "Egypt",
        "requirements": {
          "currentLocale": "Egypt"
        }
      }
    ],
    "traceNumbers": [
      "586",
      "New York Location",
      "Athens Location",
      "Egypt Location"
    ]
  },
  "13": {
    "choices": [
      {
        "effects": {
          "setHour": 23,
          "advanceTime": 6
        },
        "nextEntry": "102",
        "text": "Advance"
      }
    ],
    "description": "For you, Professor Louis Grunewald, this first day of September 1931 has been tiring and uncomfortable. Light mist has covered Arkham for most of the day. You held two uninspired undergraduate classes at Miskatonic University, and you met with the new chairman of the literature Department, a giddy Technocrat. You survey your desk and see that a stack of papers to grade has already formed. You’re enjoying your second pipe of the evening, and putting off grading papers, when the doorbell rings. To your surprise, it’s a telegraphic messenger.\n\n“It arrived at Kingspoint Head station not more than an hour ago,” the boy says.\n\nYou sign for it, and slip a dime into the youngster’s hand. “Oh, thank you, sir!” You open the envelope and scan the contents (Handout: Dark 1, see page 12).\n\nMy goodness, you think. Imagine! Dotty old Gliere in prison! You recall that he had gone to Greece to work on his book concerning primitive myths. What has he gotten himself into? Should you wire money? You recall all the amusing discussions you’ve had with him, and a sudden insight lets you understand that Tibor Gliere had no close friends except for you. Should you go help him? You suppose the University will grant you leave. But do you want to go?\n\nWith uncommon speed you decide to go to Athens to help Gliere. You write him a wire, and another to Ernest Holt, a wealthy New York financier and a good friend of yours. If you get into hot water, Holt will help, and so, you decide to keep him posted on your progress. You give both telegrams to the waiting messenger, along with the necessary funds.\n\nWhat to do now? You’ll go to the bank first thing in the morning to get travel funds. As for Trans-Atlantic schedules, well the Advertiser surely carries that information. As you pack, you wonder if you should check Gliere’s room at Mrs. Harding’s boarding house. Maybe you could get a clue about Gliere’s activities or a hint about his arrest.\n\nYour passport is in order; your clothes and sundries are packed. You’d best turn in. You’re going on a little trip. When you awake, it is Sept. 2; go to 102.",
    "title": "START",
    "traceNumbers": ["START"]
  },
  "16": {
    "title": "ARKHAM DEPOT",
    "description": "Trains to Boston leave at 9am, noon, and 5pm. The trip takes an hour. You may wait for your train, or go to any other Arkham Location.",
    "choices": [
      {
        "text": "Take the 9am train to Boston (arrives at 10am)",
        "effects": {
          "setHour": 9,
          "advanceTime": 0
        },
        "nextEntry": "64"
      },
      {
        "text": "Take the 12pm train to Boston (arrives at 1pm)",
        "effects": {
          "setHour": 12,
          "advanceTime": 0
        },
        "nextEntry": "64"
      },
      {
        "text": "Take the 5pm train to Boston (arrives at 6pm)",
        "effects": {
          "setHour": 17,
          "advanceTime": 0
        },
        "nextEntry": "64"
      },
      {
        "text": "Go to any Arkham Location",
        "nextEntry": "Arkham Location"
      }
    ],
    "traceNumbers": ["64", "Arkham Location"]
  },
  "23": {
    "description": "“Don’t try and flim-flam me! This is my boarding house and I’ll allow in whom I wish!” She slams the door.",
    "traceNumbers": ["113"],
    "choices": [
      {
        "text": "Try sneaking in later at night",
        "nextEntry": "90",
        "effects": {
          "dayAdvance": true,
          "defaultHour": 1
        }
      },
      {
        "text": "Go to another Arkham Location",
        "nextEntry": "Arkham Location"
      }
    ]
  },
  "24": {
    "description": "This constellations map is quite similar to the copy of Ptolemy’s found in the Miskatonic University collection. Strangely enough, the star patterns here are slightly twisted or even completely skewed. In fact some stars are missing completely.",
    "traceNumbers": ["72", "150"],
    "choices": [
      {
        "text": "Keep looking around the room",
        "nextEntry": "150"
      }
    ]
  },
  "25": {
    "description": "“Aristotle Mylonas, while collecting an undeniably tremendous treasure house of Greek art, has been reluctant to loan or even to show some of the National Museum’s most interesting treasures. The Karpathos Device, for example, has not been displayed for years. Its loan to other museums is, according to Mylonas, unthinkable.”—Great Museums of the Modern World.",
    "choices": [
      {
        "text": "Keep looking around the Museum",
        "requirements": {
          "currentLocale": "Arkham"
        },
        "nextEntry": "145"
      },
      {
        "text": "Keep looking around the Library",
        "requirements": {
          "currentLocale": "New York"
        },
        "nextEntry": "74"
      }
    ],
    "traceNumbers": ["63", "145"]
  },
  "28": {
    "description": "The door is locked, but you can try the window. If you want to pick the door lock, make a successful Locksmith or Hard Mechanical Repair roll. If you want to pry open the window, succeed at an STR roll.",
    "choices": [
      {
        "text": "Try the window",
        "nextEntry": "7"
      },
      {
        "text": "Pick the door lock",
        "effects": {
          "check": {
            "skill": "Locksmith",
            "success": "28a",
            "failure": "90"
          }
        }
      },
      {
        "text": "Attempt Hard Mechanical Repair",
        "effects": {
          "check": {
            "skill": "Mechanical Repair",
            "difficulty": "hard",
            "success": "28a",
            "failure": "90"
          }
        }
      },
      {
        "text": "Pry open the window with an STR roll",
        "effects": {
          "check": {
            "skill": "STR",
            "success": "28a",
            "failure": "90"
          }
        }
      }
    ],
    "traceNumbers": ["90"]
  },
  "29": {
    "description": "You see strange, bird-like markings and some scribbled words in the Professor’s familiar hand. Three of the words seem paired with the symbols—'old', 'heavens', 'cold'.",
    "choices": [
      {
        "text": "Attempt to decipher the markings with an INT roll",
        "effects": {
          "check": {
            "skill": "INT",
            "success": "124",
            "failure": "150"
          }
        }
      }
    ],
    "traceNumbers": ["150"]
  },
  "30": {
    "title": "GREEK CONSULATE",
    "description": "Concerning Greek criminal matters, they advise visiting the Athens Bureau of Investigation on arrival. A Corporal Ilionas, they say, has handled the Gliere case. You ask for information about the National Museum and its treasures, but they have only an unhelpful travel brochure. They jokingly caution you about the cab drivers of Athens.",
    "choices": [
      {
        "nextEntry": "New York Location",
        "text": "Go to any New York Location"
      }
    ],
    "traceNumbers": ["New York Location"]
  },
  "32": {
    "description": "In rifling through Gliere’s notes and letters, you find a portion of manuscript: “The Great Upheaval Myths Correlated with Climatic Change” by T. Gliere. Skimming, you see a bizarre collection of tales mentioning nearly every rumored land, from Atlantis to Mu. Many stories you do not recognize at all. Apparently, Gliere sought historical and physical evidence for these sunken and frozen legends of lands. He seems to have found common dates for the devastation myths found in nearly every culture. Interesting.",
    "choices": [
      {
        "text": "Attempt to Spot Hidden details in the manuscript",
        "effects": {
          "check": {
            "skill": "Spot Hidden",
            "success": "53",
            "failure": "150"
          }
        }
      }
    ],
    "traceNumbers": ["150"]
  },
  "36": {
    "choices": [
      {
        "nextEntry": "New York Location",
        "text": "Go to any New York Location"
      }
    ],
    "description": "Something is wrong. You learned long ago to trust your hunches. Grunewald’s telegrams stopped without explanation 72 hours ago; your inquiries have gone unanswered. Should you alert your agents scattered across the globe? Judiciously sipping superb brandy, at last you decide against the employment of proxies. Grunewald hinted of mysteries beyond the capacities of mere assistants. You trust his judgment and decide to go yourself. You scrawl instructions to subordinates and dictate phone messages to a secretary whom you have callously woken from a sound sleep. Your holdings will tend themselves for a few weeks. Your passport is in order. You’ll pull strings to get an assortment of visas overnight: mere governments cannot keep Ernest Holt from aiding a friend. A liner sails soon. Jenkins can have you packed and ready to go in an hour. You have plenty of time. It’s a pity your experimental trans-Atlantic passenger plane isn’t quite ready, though that would be fun! You find yourself eagerly anticipating action in the field. You feel ready for anything. You call Lydia Lau at The New York Sun. A despicable rag of a newspaper, but a crackerjack young lady with lots of talent. Miss Lau has heard nothing from Grunewald. You notice her professional interest grow as you talk, and you ask her to write nothing for a few days. “I’m sure there’s a proper explanation,” you say grandly, but somehow you know that neither of you believes that statement. Now you sleep. You’ll attend to details tomorrow. When you wake, go to any New York Location.",
    "title": "ERNEST HOLT’S APARTMENT",
    "traceNumbers": ["START"]
  },
  "37": {
    "choices": [
      {
        "nextEntry": "New York Location",
        "text": "Go to any New York Location"
      }
    ],
    "description": "You flirted with the City Editor, and then polished up the National Editor. As usual, your skills and your baby-blues got you what you wanted, and you don’t mind giving an old goat a lift now and then. Besides, this could be the biggest story of your young life, or so you hope. Headlines sail through your imagination: “MISKATONIC MYSTERY!” “GAL GUMSHOE TRACKS DOWN MISSING PROFESSOR!” “FINANCIER FOUND ALIVE!” And your by-line is under every one. With Gliere dead, and Holt and Grunewald missing, you’re pretty sure that the story behind this one will be a real jaw-dropper— and probably dangerous. Holt’s been missing for 72 hours. You thoughtfully pack the gigantic revolver given to you by Bruno the vice-squad cop. A girl can’t be too careful, you decide. You can leave soon on one of the regular liners, and in the meantime do some shopping and research—maybe even make a trip to Arkham. You send a telegram to your beau, Devon Wilson, aboard the USS Rochester, telling him your plans and that you’ll keep in touch. The Sun’s circulation boost from this story should blow that pipsqueak Daily News right out of the water, you dreamily calculate. As for you, it’ll be goodbye New York—hello Pulitzer Prize! In the morning, go to any New York Location.",
    "title": "Lydia Lau's Apartment",
    "traceNumbers": ["START"]
  },
  "38": {
    "choices": [
      {
        "nextEntry": "Arkham Location",
        "requirements": {
          "currentLocale": "Arkham"
        },
        "text": "Finish shopping"
      },
      {
        "nextEntry": "New York Location",
        "requirements": {
          "currentLocale": "New York"
        },
        "text": "Finish shopping"
      },
      {
        "nextEntry": "Athens Location",
        "requirements": {
          "currentLocale": "Athens"
        },
        "text": "Finish shopping"
      },
      {
        "nextEntry": "Egypt Location",
        "requirements": {
          "currentLocale": "Egypt"
        },
        "text": "Finish shopping"
      },
      {
        "text": "Finish shopping",
        "requirements": {
          "currentLocale": "Bremen"
        },
        "nextEntry": "Bremen Location"
      }
    ],
    "description": "This retailer accepts currency from any country.",
    "title": "RETAIL STORE",
    "traceNumbers": [
      "Arkham Location",
      "New York Location",
      "Athens Location",
      "Egypt Location",
      "Bremen Location"
    ]
  },
  "41": {
    "description": "Attempt the appropriate Language roll for each of the following books. For each successful roll, spend two hours and go to the pertinent entry:",
    "choices": [
      {
        "text": "Attempt a German roll for 'Die Mythe'",
        "effects": {
          "check": {
            "skill": "Language (German)",
            "success": {
              "nextEntry": "62",
              "advanceTime": 2
            },
            "failure": "41"
          },
          "dailyLimit": 1
        }
      },
      {
        "text": "Attempt a French roll for 'Cultes des Goules'",
        "effects": {
          "check": {
            "skill": "Language (French)",
            "success": {
              "nextEntry": "84",
              "advanceTime": 2
            },
            "failure": "41"
          },
          "dailyLimit": 1
        }
      },
      {
        "text": "Attempt a Latin roll for 'Liber Ivonis'",
        "effects": {
          "check": {
            "skill": "Language (Latin)",
            "success": {
              "nextEntry": "140",
              "advanceTime": 2,
              "skills": {
                "Cthulhu Mythos": 1
              },
              "sanity": 1
            },
            "failure": "41"
          },
          "dailyLimit": 1
        }
      },
      {
        "text": "Attempt an English roll for 'Marvels of the Spirit World'",
        "effects": {
          "check": {
            "skill": "Language (English)",
            "success": {
              "nextEntry": "159",
              "advanceTime": 2
            },
            "failure": "41"
          },
          "dailyLimit": 1
        }
      },
      {
        "text": "Keep looking around the Library",
        "nextEntry": "74"
      }
    ],
    "traceNumbers": ["62", "74", "84", "140", "159"]
  },
  "45": {
    "description": "“That’s just fancy talk! I know your sort! Professor Gliere specifically instructed that no one disturb his room.” She slams the door.",
    "choices": [
      {
        "text": "Try sneaking in later at night",
        "nextEntry": "90"
      },
      {
        "text": "Go to another Arkham Location",
        "nextEntry": "Arkham Location"
      }
    ],
    "traceNumbers": ["67", "113"]
  },
  "46": {
    "description": "Curious, you think. That symbol looks almost like a map (see image below). You take the notepaper with you.",
    "image": "src/assets/images/maps/map46.png",
    "choices": [
      {
        "text": "Take the notepaper and continue your investigation",
        "nextEntry": "150"
      }
    ],
    "traceNumbers": ["49", "294"]
  },
  "47": {
    "description": "A new steward enters, carrying fresh towels for your stateroom. He looks Egyptian.",
    "choices": [
      {
        "text": "Do you notice anything?",
        "requirements": {
          "hasNotVisited": "47"
        },
        "effects": {
          "check": {
            "skill": "Spot Hidden",
            "success": "91",
            "failure": "10"
          }
        }
      },
      {
        "text": "Make a Anthropology roll",
        "requirements": {
          "hasNotVisited": "47"
        },
        "effects": {
          "check": {
            "skill": "Anthropology",
            "success": "9",
            "failure": "10"
          }
        }
      },
      {
        "text": "Make a Luck roll",
        "requirements": {
          "hasNotVisited": "47"
        },
        "effects": {
          "check": {
            "skill": "Luck",
            "success": "106",
            "failure": "10"
          }
        }
      },
      {
        "text": "Get some rest and wake up tomorrow morning",
        "nextEntry": "187",
        "requirements": {
          "hasVisited": "47"
        },
        "effects": {
          "setHour": 23,
          "advanceTime": 6
        }
      }
    ],
    "traceNumbers": ["167", "187"]
  },
  "47b": {
    "description": "You are exhausted and cannot continue without rest.",
    "choices": [
      {
        "text": "Get some rest and wake up tomorrow morning",
        "nextEntry": "187",
        "effects": {
          "setHour": 23,
          "advanceTime": 6
        }
      }
    ]
  },
  "48": {
    "description": "“Aristotle Mylonas, Director of the National Museum of Archaeology in Athens, died today in a bizarre automobile accident. His car, apparently going much too fast, spun through the railing of a stone bridge across the Illissus River. This internationally known scholar, largely responsible for the protection of many Greek national treasures, will be sorely missed. A reclusive man, Mylonas was unmarried and without other family. He declared always that his beloved Greece was both mother and father to him.”—Arkham Advertiser, July 1, 1931",
    "choices": [
      {
        "text": "Return to newspaper",
        "nextEntry": "60"
      }
    ],
    "traceNumbers": ["60"]
  },
  "49": {
    "description": "You find a piece of notepaper with a curious design.",
    "choices": [
      {
        "text": "Look at it closely",
        "nextEntry": "46"
      },
      {
        "text": "Keep looking around the room",
        "nextEntry": "150"
      }
    ],
    "traceNumbers": ["150"]
  },
  "51": {
    "description": "Suddenly, Mrs. Harding appears. “Why the idea!” She sputters. “I’ll count to three,” she says, her grip tightening on the shotgun she’s pointing in your general direction, “and then I’ll pull the trigger! One… two…” You quickly decide to leave.",
    "choices": [
      {
        "text": "Run!",
        "nextEntry": "Arkham Location"
      }
    ],
    "traceNumbers": ["7", "28", "52", "141", "150"]
  },
  "52": {
    "description": "You've managed to enter the Harding House without causing too much disturbance. Now, you must navigate quietly.",
    "choices": [
      {
        "text": "Sneak into room A",
        "effects": {
          "check": {
            "skill": "Stealth",
            "success": "141",
            "failure": "141b"
          }
        }
      },
      {
        "text": "Sneak into room B",
        "effects": {
          "check": {
            "skill": "Stealth",
            "success": "2",
            "failure": "2"
          }
        }
      },
      {
        "text": "Sneak into room C",
        "effects": {
          "check": {
            "skill": "Stealth",
            "success": "11",
            "failure": "11b"
          }
        }
      },
      {
        "text": "Sneak into room D",
        "effects": {
          "check": {
            "skill": "Stealth",
            "success": "150",
            "failure": "150b"
          }
        }
      }
    ]
  },
  "53": {
    "description": "You find a letter from a Mr. Velikovsky, postmarked Palestine. The scrawl is difficult to read, but you can see that the author greets Gliere’s work 'with joy.' There is a page about the Vedas and how they confirm something called the 'Polar Reversal.' One portion deals with the 'Era of Fertility on the Frozen Continent.' Velikovsky reports that work on 'Freudian Heroes'—including Ikhenaten—continues.",
    "choices": [
      {
        "text": "Keep looking around the room",
        "nextEntry": "150"
      }
    ],
    "traceNumbers": ["32"]
  },
  "54": {
    "choices": [
      {
        "nextEntry": "New York Location",
        "requirements": {
          "currentLocale": "New York"
        },
        "text": "Finish shopping"
      }
    ],
    "description": "Three floors of books! Some titles interest you. You have enough suitcase room for no more than three.",
    "title": "E.S. WILENTZ BOOKSTORE",
    "traceNumbers": ["New York Location"]
  },
  "56": {
    "description": "You can take individual cab trips, but it's far better value to book a cab for the day.",
    "choices": [
      {
        "nextEntry": "New York Location",
        "text": "Go to any New York Location"
      }
    ],
    "traceNumbers": ["New York Location"]
  },
  "60": {
    "choices": [
      {
        "text": "Scheduled sailings of ocean liners",
        "nextEntry": "136"
      },
      {
        "text": "News of Athens",
        "nextEntry": "80"
      },
      {
        "text": "Library Use roll",
        "nextEntry": "48",
        "effects": {
          "check": {
            "skill": "Library Use",
            "success": "48",
            "failure": "60"
          },
          "time": 1
        }
      },
      {
        "text": "Spot Hidden roll",
        "nextEntry": "125",
        "effects": {
          "check": {
            "skill": "Spot Hidden",
            "success": "125",
            "failure": "60"
          },
          "time": 1
        }
      },
      {
        "text": "Luck roll",
        "nextEntry": "168",
        "effects": {
          "check": {
            "skill": "Luck",
            "success": "168",
            "failure": "60"
          },
          "time": 1
        }
      },
      {
        "text": "October or later",
        "nextEntry": "172",
        "requirements": {
          "dateAfter": "1931-09-30"
        }
      },
      {
        "text": "Finish at newspaper",
        "nextEntry": "Arkham Location"
      }
    ],
    "description": "You can look up scheduled sailings. You notice a newspaper with news of Athens. For each hour spent browsing through the paper’s back-issue files, you can attempt one of the following rolls once.",
    "title": "ARKHAM ADVERTISER",
    "traceNumbers": ["Arkham Location"]
  },
  "61": {
    "description": "You notice flakes of dry skin; someone has left behind his or her sunburn, you think. Quite out of place to do it in this fine shop. You look around and see two figures, one short and one tall, staring directly at you. You quickly leave the shop.",
    "choices": [
      {
        "text": "Leave the shop and move on with your day",
        "nextEntry": "126"
      }
    ],
    "traceNumbers": ["133", "126"]
  },
  "62": {
    "description": "The ancient myths refer to Gotterdammerung, the fall of the Gods. Inexplicably, almost all of these Northern myths say that the climate became colder after that fall.",
    "choices": [
      {
        "text": "Make a Luck roll",
        "effects": {
          "check": {
            "skill": "Luck",
            "success": "117",
            "failure": "74"
          }
        }
      }
    ],
    "traceNumbers": ["41", "74"]
  },
  "63": {
    "description": "This democratic nation of freedom-loving peoples has a complex and lengthy history. They are fiercely protective of their rights, and even more protective of the precious artifacts of their heritage.",
    "choices": [
      {
        "text": "Make a Education roll",
        "effects": {
          "check": {
            "skill": "EDU",
            "success": "25",
            "failure": "74"
          }
        }
      },
      {
        "text": "Keep looking around the Library",
        "nextEntry": "74"
      }
    ],
    "traceNumbers": ["74"]
  },
  "64": {
    "title": "BOSTON RAILWAY STATION",
    "description": "There are trains to New York City’s Grand Central Station and Arkham. Should you miss the train, you have friends in Boston who will gladly put you up for the night for free. You can then catch your train in the morning.",
    "choices": [
      {
        "text": "Take the 10am train to New York (arrives at 5pm)",
        "effects": {
          "setHour": 10,
          "advanceTime": 7
        },
        "nextEntry": "New York Location"
      },
      {
        "text": "Take the 4pm train to New York (arrives at 10pm)",
        "effects": {
          "setHour": 16,
          "advanceTime": 6
        },
        "nextEntry": "New York Location"
      },
      {
        "text": "Take the 10am train to Arkham (arrives at 11am)",
        "effects": {
          "setHour": 10,
          "advanceTime": 1
        },
        "nextEntry": "Arkham Location"
      },
      {
        "text": "Take the 1pm train to Arkham (arrives at 2pm)",
        "effects": {
          "setHour": 13,
          "advanceTime": 1
        },
        "nextEntry": "Arkham Location"
      },
      {
        "text": "Take the 6pm train to Arkham (arrives at 7pm)",
        "effects": {
          "setHour": 18,
          "advanceTime": 1
        },
        "nextEntry": "Arkham Location"
      },
      {
        "text": "Stay overnight in Boston and catch a morning train",
        "effects": {
          "setHour": 6
        },
        "nextEntry": "64"
      }
    ],
    "traceNumbers": ["16", "146"]
  },
  "67": {
    "description": "Her eyes are wary, but she is listening.",
    "choices": [
      {
        "text": "Make a Persuade roll",
        "effects": {
          "check": {
            "skill": "Persuade",
            "success": "150",
            "failure": "45"
          }
        }
      }
    ],
    "traceNumbers": ["113"]
  },
  "69": {
    "description": "Two foreigners stand on deck. The tall fellow wears a robe with a cowl. He is perhaps Arabic or Turkish. A shorter fellow, ferret-like, looks in your direction. Though they seem out of place on this ship, they make you feel uncomfortable.",
    "choices": [
      {
        "text": "Proceed to the next day",
        "nextEntry": "187",
        "effects": {
          "setHour": 23,
          "advanceTime": 6
        }
      }
    ],
    "traceNumbers": ["73", "83"]
  },
  "70": {
    "description": "“The myth of the cataclysm, or the upheaval, is one of the oldest tales and is found in nearly every culture. These imagined events occurred, according to some Nordic myths, three or four thousand years ago. Other legends, notably those told by the Shikastra sect of Tibet, date the world-changing disaster to as recently as 850 BC.”—T. Gliere, The Destruction Myths.",
    "choices": [
      {
        "text": "Keep looking around the Museum",
        "nextEntry": "145"
      }
    ],
    "traceNumbers": ["145"]
  },
  "72": {
    "description": "You find a map of the heavens, resting on one of the shelves.",
    "choices": [
      {
        "text": "Take a closer look",
        "nextEntry": "24"
      },
      {
        "text": "Return to 150",
        "nextEntry": "150"
      }
    ],
    "traceNumbers": ["150"]
  },
  "73": {
    "title": "FIRST SUNDAY",
    "description": "You are enjoying your first Sunday on the ship.",
    "choices": [
      {
        "text": "Rest in Room",
        "nextEntry": "167",
        "requirements": {
          "scheduledActivity": {
            "am": "Rest in Room",
            "pm": "Rest in Room",
            "night": "Rest in Room"
          }
        }
      },
      {
        "text": "Notice anything on the Ship's Tour?",
        "nextEntry": "69",
        "requirements": {
          "scheduledActivity": {
            "pm": "Ship's Tour"
          }
        },
        "effects": {
          "check": {
            "skill": "INT",
            "success": "69",
            "failure": "73a"
          }
        }
      },
      {
        "text": "Time for bed",
        "nextEntry": "187",
        "effects": {
          "setHour": 23,
          "advanceTime": 6
        }
      }
    ],
    "traceNumbers": ["8", "187"]
  },
  "74": {
    "title": "NEW YORK PUBLIC LIBRARY",
    "description": "While not allowing browsers, the helpful librarians provide a selection of books on a topic. They are busy and understaffed, so only two topics may be researched per visit. You may go to another location and then return here in the same day.\n\nNo rolls are needed for these books. It takes two hours to study each topic.",
    "choices": [
      {
        "text": "Study Archaeology",
        "nextEntry": "116"
      },
      {
        "text": "Study Egyptology",
        "nextEntry": "85"
      },
      {
        "text": "Study Greece",
        "nextEntry": "63"
      },
      {
        "text": "Study Occult",
        "nextEntry": "41"
      },
      {
        "text": "Study other pertinent topics",
        "nextEntry": "138"
      }
    ],
    "traceNumbers": ["New York Location"]
  },
  "80": {
    "description": "“In a gala ceremony, Zeno Pisistratos was installed as curator of the National Museum of Archaeology at Athens today. Pisistratos, an expert in Greek and Egyptian antiquities, is said to be interested in arranging exchange-exhibits with other important world museums.” —Arkham Advertiser, July 20, 1931.",
    "choices": [
      {
        "text": "Return to newspaper",
        "nextEntry": "60"
      }
    ],
    "traceNumbers": ["60"]
  },
  "82": {
    "choices": [
      {
        "nextEntry": "145",
        "text": "Visit the library"
      },
      {
        "nextEntry": "122",
        "requirements": {
          "character": "Professor Grunewald",
          "dateBefore": "1931-09-09"
        },
        "text": "See Dr. Martin Fen"
      },
      {
        "nextEntry": "143",
        "requirements": {
          "character": "Professor Grunewald",
          "dateAfter": "1931-09-08"
        },
        "text": "See Dr. Martin Fen"
      },
      {
        "nextEntry": "100",
        "requirements": {
          "character": "Professor Grunewald",
          "dateBefore": "1931-09-09"
        },
        "text": "See the Dean"
      },
      {
        "nextEntry": "197",
        "requirements": {
          "character": "Professor Grunewald",
          "dateAfter": "1931-09-08"
        },
        "text": "See the Dean"
      },
      {
        "nextEntry": "Arkham Location",
        "text": "Finish at university"
      }
    ],
    "description": "The MU library is open 9am to 9pm, Mon-Sat.",
    "title": "MISKATONIC UNIVERSITY",
    "traceNumbers": ["Arkham Location"]
  },
  "83": {
    "description": "The ship is bustling with activity.",
    "choices": [
      {
        "text": "Something peaks your interest",
        "nextEntry": "69",
        "requirements": {
          "hasNotVisited": "69"
        }
      },
      {
        "text": "Ask around about suspicions",
        "requirements": {
          "hasVisited": "69"
        },
        "effects": {
          "check": {
            "skill": "INT",
            "success": "115",
            "failure": "83a"
          }
        }
      },
      {
        "text": "Move on a day",
        "nextEntry": "73a"
      }
    ],
    "traceNumbers": ["69", "115", "187"]
  },
  "84": {
    "description": "A chapter notes that the most bizarre case of 'undead' occurred among French Legionnaires in North Africa. Outpost guards were found strangled with flecks of dead, scaly skin still sticking to their throats.",
    "choices": [
      {
        "text": "Continue looking over the Occult books",
        "nextEntry": "41"
      },
      {
        "text": "Return to the New York Public Library",
        "nextEntry": "74"
      }
    ],
    "traceNumbers": ["41", "74"]
  },
  "85": {
    "description": "“Egypt today is an engaging mixture of ancient and modern. Camels and marketplaces are side-by-side with motorcars and luxurious hotels. Religions of various kinds play a special role in Egypt, some of them of a most unusual nature. It is best, for example, to avoid the cult of Aten, a mysterious and perhaps dangerous group found in the major cities of Cairo and Alexandria.”\n\n—Baedeker’s Guide to Egypt",
    "choices": [
      {
        "text": "Make a Library Use roll",
        "effects": {
          "check": {
            "skill": "Library Use",
            "success": "161",
            "failure": "74"
          }
        }
      },
      {
        "text": "Continue",
        "nextEntry": "74"
      }
    ],
    "traceNumbers": ["74"]
  },
  "86": {
    "title": "NEW YORK SUN",
    "description": "“The oft-delayed Starkweather-Moore expedition to the Antarctic nears completion, with a late December departure now virtually certain. Bremerhaven, Germany, will be the expedition’s jumping-off point, and its last European port of call.”\n\n“An American professor, Dr. Tibor Gliere of Miskatonic University, has been arrested for the alleged theft of an antiquity. Miskatonic’s Dean Wilcox reports that a colleague, Professor Louis Grunewald, has gone to Athens to investigate the matter for the University.”",
    "choices": [
      {
        "text": "There's more to learn here.",
        "requirements": {
          "dateAfter": "1931-09-08"
        },
        "nextEntry": "95"
      },
      {
        "text": "Go to any New York Location.",
        "requirements": {
          "dateBefore": "1931-09-08"
        },
        "nextEntry": "New York Location"
      }
    ]
  },
  "88": {
    "description": "While formerly fashionable, avant-garde has become politically suspect. The occult is faddish with many of the younger politicians. Various readings and portents are said to promise a bright future for the Fatherland.",
    "choices": [
      {
        "text": "Continue your research into other topics",
        "nextEntry": "138"
      },
      {
        "text": "Keep looking around the Library",
        "nextEntry": "74"
      }
    ],
    "traceNumbers": [138]
  },
  "89": {
    "description": "Mrs. Harding glares and slams the door in your face.",
    "choices": [
      {
        "text": "Sneak in later, when everyone is sleeping",
        "nextEntry": "90",
        "effects": {
          "dayAdvance": true,
          "defaultHour": 1
        }
      },
      {
        "text": "Go to any Arkham Location",
        "nextEntry": "Arkham Location"
      }
    ],
    "traceNumbers": ["113"]
  },
  "90": {
    "description": "The boarding house is quiet. You creep onto the porch.",
    "choices": [
      {
        "nextEntry": "7",
        "text": "Try the window"
      },
      {
        "nextEntry": "28",
        "text": "Try the door"
      }
    ],
    "traceNumbers": ["23", "45", "89"]
  },
  "91": {
    "description": "Something glistens beneath his open jacket, troubling you. With a successful Dodge roll, you can push past him and escape; he will not follow; move on a day and go to the ship activity table at 187. If you fail the Dodge or wish confrontation, go to 10.",
    "choices": [
      {
        "text": "Attempt a Dodge roll.",
        "effects": {
          "check": {
            "skill": "Dodge",
            "success": {
              "nextEntry": "187",
              "dayAdvance": true
            },
            "failure": "10"
          }
        }
      },
      {
        "text": "Confront him",
        "nextEntry": "10"
      }
    ],
    "traceNumbers": ["47", "187"]
  },
  "95": {
    "description": "“Professor Gliere’s suicide has shocked and saddened the Miskatonic academic community. No word has yet come from Professor Grunewald.”",
    "choices": [
      {
        "text": "There's more to learn here.",
        "requirements": {
          "dateAfter": "1931-10-15"
        },
        "nextEntry": "178"
      },
      {
        "text": "Go to any New York Location.",
        "requirements": {
          "dateBefore": "1931-10-15",
          "currentLocale": "New York"
        },
        "nextEntry": "New York Location"
      },
      {
        "text": "Go to any Athens Location.",
        "requirements": {
          "dateBefore": "1931-10-15",
          "currentLocale": "Athens"
        },
        "nextEntry": "Athens Location"
      }
    ]
  },
  "100": {
    "description": "The Dean shakes his head, 'Out of the question, Grunewald. I already have that young dolt Perkins covering for Gliere. And now you want to leave? Not a chance, sir.' Does the Dean leave you no choice?",
    "choices": [
      {
        "text": "Threaten to resign",
        "nextEntry": "186"
      },
      {
        "text": "Forget the whole business and let Gliere fend for himself",
        "nextEntry": "574"
      }
    ],
    "traceNumbers": ["82"]
  },
  "102": {
    "choices": [
      {
        "nextEntry": "147",
        "requirements": {
          "characterNot": "Professor Grunewald",
          "dateAfter": "1931-09-08"
        },
        "text": "After 8 September"
      },
      {
        "nextEntry": "Arkham Location",
        "requirements": {
          "character": "Professor Grunewald"
        },
        "text": "Go to any Arkham Location"
      },
      {
        "nextEntry": "120",
        "requirements": {
          "characterNot": "Professor Grunewald",
          "dateBefore": "1931-09-09"
        },
        "text": "Not Grunewald"
      }
    ],
    "description": "You are outside Grunewald's home.",
    "title": "GRUNEWALD'S HOME",
    "traceNumbers": []
  },
  "104": {
    "title": "PIER 56: CUNARD LINES",
    "description": "The representative informs you that a liner departs each Saturday at noon, reaching Athens at noon nine days later, and Alexandria at 1pm one day later. Tickets are available and include all meals.",
    "choices": [
      {
        "text": "Take the Saturday noon liner to Athens (arrives nine days later at noon)",
        "effects": {
          "setDay": "Saturday",
          "setHour": 0,
          "advanceTime": 5
        },
        "nextEntry": "187"
      },
      {
        "text": "Take the Saturday noon liner to Alexandria (arrives ten days later at 1pm)",
        "effects": {
          "setDay": "Saturday",
          "setHour": 0,
          "advanceTime": 5
        },
        "nextEntry": "187"
      },
      {
        "text": "Go to any New York Location",
        "nextEntry": "New York Location"
      }
    ],
    "traceNumbers": ["187", "New York Location"]
  },
  "106": {
    "description": "The small man pulls out a dagger and swings it toward your midsection with alarming speed, but it misses and sticks into the wall. Meanwhile, you can retrieve a weapon (if you carry one) or you can run.",
    "choices": [
      {
        "text": "Run (attempt a Dodge roll)",
        "nextEntry": "106a",
        "effects": {
          "check": {
            "skill": "Dodge",
            "success": "47b",
            "failure": {
              "nextEntry": "106a",
              "damage": "1D6",
              "message": "The stranger lets loose a shot as you fail to dodge."
            }
          }
        }
      },
      {
        "text": "Retrieve a weapon and fight",
        "nextEntry": "106a",
        "effects": {
          "combat": {
            "opponent": {
              "name": "Small Man",
              "attackChance": "50%",
              "damage": "1D6",
              "dex": 60,
              "health": 3,
              "maxHealth": 3
            },
            "win": "585",
            "lose": "585"
          }
        }
      }
    ],
    "traceNumbers": ["47", "135", "187"]
  },
  "109": {
    "title": "FIRST MONDAY",
    "description": "You are enjoying your first Monday on the ship.",
    "choices": [
      {
        "text": "Stroll Decks (am)",
        "nextEntry": "83",
        "requirements": {
          "scheduledActivity": {
            "am": "Stroll Decks"
          }
        }
      },
      {
        "text": "Rest on Deck Chairs (pm)",
        "nextEntry": "83",
        "requirements": {
          "scheduledActivity": {
            "pm": "Rest on Deck Chairs"
          }
        }
      },
      {
        "text": "Have a few Cocktails (night)",
        "nextEntry": "83",
        "requirements": {
          "scheduledActivity": {
            "night": "Cocktails"
          }
        }
      },
      {
        "text": "Move on to the next day",
        "nextEntry": "187",
        "effects": {
          "setHour": 23,
          "advanceTime": 6
        }
      }
    ],
    "traceNumbers": ["83", "187"]
  },
  "110": {
    "description": "Some of the wonderful devices were said to open secret chambers or panels in the tombs. These chambers were thought to be in places that looked like solid rock. No intact device has been found, though, nor have any such chambers been discovered.",
    "choices": [
      {
        "text": "Keep looking around the Library",
        "nextEntry": "74"
      }
    ],
    "traceNumbers": ["116"]
  },
  "111": {
    "description": "The film today is Alfred Hitchcock’s Murder. You look forward to seeing the film and feel that young Hitchcock is a promising director.",
    "choices": [
      {
        "text": "Watch the film and make a Listen roll",
        "effects": {
          "check": {
            "skill": "Listen",
            "success": "137",
            "failure": "137b"
          }
        }
      }
    ],
    "traceNumbers": ["126", "137"]
  },
  "113": {
    "choices": [
      {
        "text": "Try to Fast Talk her",
        "nextEntry": "23"
      },
      {
        "text": "Try to Charm her",
        "nextEntry": "45"
      },
      {
        "text": "Try to Persuade her",
        "nextEntry": "67"
      },
      {
        "text": "Try to Bribe her",
        "nextEntry": "89"
      }
    ],
    "description": "Mrs. Harding greets you amiably. She is uncertain whether she should show you Gliere’s room.",
    "title": "HARDING HOUSE",
    "traceNumbers": ["Arkham Location"]
  },
  "115": {
    "description": "You ask the purser about the foreign pair seen on deck. 'Egyptian, I believe. Rather a strange lot, I’d say. Haven’t been giving you any trouble, have they?' You thank him and leave.",
    "choices": [
      {
        "text": "Take a rest",
        "nextEntry": "187",
        "effects": {
          "setHour": 23,
          "advanceTime": 6
        }
      }
    ],
    "traceNumbers": ["83"]
  },
  "116": {
    "description": "It is suggested that the Karpathos Device found in 1900 is in fact of Egyptian origin or design, but was, for some reason, stolen. In fact, some scholars have argued that it is one of the “wonder devices” of the Aten pyramids.",
    "choices": [
      {
        "text": "Make a History roll",
        "effects": {
          "check": {
            "skill": "History",
            "success": "110",
            "failure": "74"
          }
        }
      },
      {
        "text": "Make a Hard Education roll",
        "effects": {
          "check": {
            "skill": "EDU",
            "difficulty": "hard",
            "success": "110",
            "failure": "74"
          }
        }
      }
    ],
    "traceNumbers": ["74"]
  },
  "117": {
    "description": "There is an etching of a supposedly enchanted symbol (see image below). You think the drawing important, and copy it down.",
    "image": "src/assets/images/clues/clue117.png",
    "choices": [
      {
        "text": "Look over the other books",
        "nextEntry": "41"
      },
      {
        "text": "Return to the New York Public Library",
        "nextEntry": "74"
      }
    ],
    "traceNumbers": ["62", "41", "74"]
  },
  "119": {
    "description": "The friendly natives of Micronesia seem to have some deep-seated fear of an angry god who will rise from the sea. British sailors, seeing the odd idols throughout the islands, named the god 'Old One-Eyed Reilly.'",
    "choices": [
      {
        "text": "Continue your research into other topics",
        "nextEntry": "138"
      },
      {
        "text": "Keep looking around the Library",
        "nextEntry": "74"
      }
    ],
    "traceNumbers": ["138"]
  },
  "121": {
    "description": "You see the book Nameless Cults, in the Golden Goblin Press edition. You thumb through it—vile stuff, you decide. Something about this book alarms and fascinates you and you spend an hour reading it over. Gain +3 Cthulhu Mythos skill points for your initial reading. You take the book with you.",
    "choices": [
      {
        "text": "Keep looking around the room",
        "nextEntry": "150",
        "effects": {
          "time": 1,
          "skills": {
            "Cthulhu Mythos": 3
          },
          "inventory": [
            {
              "type": "book",
              "name": "Nameless Cults",
              "initialEffect": {
                "skills": {
                  "Cthulhu Mythos": 3
                }
              },
              "fullReadingEffect": {
                "sanityLoss": "2D8",
                "skills": {
                  "Cthulhu Mythos": 9
                },
                "spell": {
                  "name": "Summon Byakhee",
                  "learningTime": "1D6"
                }
              }
            }
          ]
        }
      }
    ],
    "traceNumbers": ["150"]
  },
  "122": {
    "description": "His eyes narrow when he hears your news. 'Gliere in jail? And you want to go rescue him? You’d best talk to Dean Wilcox.'",
    "choices": [
      {
        "text": "Talk to the Dean",
        "nextEntry": "100"
      },
      {
        "text": "Don’t talk to the Dean, go to the library",
        "nextEntry": "82"
      }
    ],
    "traceNumbers": ["82"]
  },
  "124": {
    "description": "They are Egyptian hieroglyphics. Make a successful Language (Hieroglyphics) roll.",
    "choices": [
      {
        "text": "Attempt to decipher the hieroglyphics",
        "effects": {
          "check": {
            "skill": "Language (Hieroglyphics)",
            "success": "212",
            "failure": "150"
          }
        }
      }
    ],
    "traceNumbers": ["29"]
  },
  "125": {
    "description": "“Greek sponge divers have recovered a puzzling device off the island of Karpathos, a small island between Crete and Turkey. The device is a mechanism believed to be thousands of years old, yet bright and untarnished, as though made yesterday. Scientists have declined comment on the metal from which the device is made. Archaeological experts from the National Museum have taken possession of the oddity for further study.”—Arkham Advertiser, June 8, 1900.",
    "choices": [
      {
        "text": "Return to newspaper",
        "nextEntry": "60"
      }
    ],
    "traceNumbers": ["60"]
  },
  "126": {
    "description": "You are enjoying a beautiful day on the ship.",
    "choices": [
      {
        "text": "Go to the Cinema (am)",
        "nextEntry": "111",
        "requirements": {
          "hasNotVisited": "111",
          "scheduledActivity": {
            "am": "Cinema"
          }
        }
      },
      {
        "text": "Go Shopping (pm)",
        "nextEntry": "133",
        "requirements": {
          "hasNotVisited": "133",
          "scheduledActivity": {
            "pm": "Shopping"
          }
        }
      },
      {
        "text": "Visit the Library (night)",
        "nextEntry": "155",
        "requirements": {
          "hasNotVisited": "155",
          "scheduledActivity": {
            "night": "Library"
          }
        }
      },
      {
        "text": "A group seems to be gathering",
        "nextEntry": "590",
        "requirements": {
          "dayOfJourney": 5
        }
      },
      {
        "text": "Rest for the night",
        "nextEntry": "187",
        "effects": {
          "setHour": 23,
          "advanceTime": 6
        }
      }
    ],
    "traceNumbers": ["61", "133", "137", "187", "192"]
  },
  "590": {
    "description": "The purser tells you that skeet shooting from the fantail will soon begin.",
    "choices": [
      {
        "text": "Get some shotgun practice",
        "nextEntry": "189"
      },
      {
        "text": "Rest for the night",
        "nextEntry": "187",
        "effects": {
          "setHour": 23,
          "advanceTime": 6
        }
      }
    ],
    "traceNumbers": ["192"]
  },
  "189": {
    "description": "As you exhibit your prowess with a skeet gun, you hear a soft pop! Hearing a bullet whine past your ear. You wheel around. No gunman is in sight. The other shooters have not noticed the gunshot. Despite their stares, you abruptly leave the competition.",
    "choices": [
      {
        "text": "Rest for the night",
        "nextEntry": "187",
        "effects": {
          "setHour": 23,
          "advanceTime": 6
        }
      }
    ],
    "traceNumbers": ["590"]
  },
  "133": {
    "description": "What a splendid ship! You have all the comforts of a big city within a few hundred feet of your cabin: beauty salon, fine men’s clothing, jewelry, sporting goods, books, etc. You decide to look at some new gloves.",
    "choices": [
      {
        "text": "Attempt a Spot Hidden roll",
        "effects": {
          "check": {
            "skill": "Spot Hidden",
            "success": {
              "nextEntry": "61",
              "message": "You successfully spot something interesting."
            },
            "failure": {
              "nextEntry": "126",
              "message": "You don't notice anything unusual and continue your day."
            }
          }
        }
      }
    ],
    "traceNumbers": ["61", "126"]
  },
  "136": {
    "description": "A Cunard liner departs Pier 56 in New York City every Saturday for Athens and Alexandria, with intermediate stops. The trip takes nine days to Athens and one more to Alexandria.",
    "choices": [
      {
        "text": "Return to newspaper",
        "nextEntry": "60"
      }
    ],
    "traceNumbers": ["60"]
  },
  "137": {
    "description": "You hear two people coming down the row of seats and sit behind you. Entering, you noticed that the theater was nearly empty.",
    "choices": [
      {
        "text": "Attempt to escape with a DEX roll",
        "effects": {
          "check": {
            "skill": "DEX",
            "success": {
              "nextEntry": "187",
              "message": "You successfully get out of your seat and out of the theater. Continue about your day."
            },
            "failure": {
              "nextEntry": "137b",
              "message": "You fail to escape in time."
            }
          }
        }
      }
    ],
    "traceNumbers": ["111", "126", "187"]
  },
  "138": {
    "description": "Your mind reels as you see all the areas you could study. Three in particular seem of interest.",
    "choices": [
      {
        "text": "Study Polar Studies",
        "nextEntry": "163"
      },
      {
        "text": "Study Pacific Isles",
        "nextEntry": "119"
      },
      {
        "text": "Study Germany",
        "nextEntry": "88"
      },
      {
        "text": "Keep looking around the Library",
        "nextEntry": "74"
      },
      {
        "text": "Go to any New York Location",
        "nextEntry": "New York Location"
      }
    ],
    "traceNumbers": ["74", "119", "163"]
  },
  "139": {
    "description": "Just at that moment, one of the ship’s officers enters, distracting the thing—allowing you to get away! The officer, his hair standing on end, wisely turns on his heels and runs with you down the hall to safety. The captain has you guarded for the rest of the trip; no sign of your attackers are found. You have no more ship activities selections.",
    "choices": [
      {
        "text": "Disembark at Athens",
        "nextEntry": "173"
      },
      {
        "text": "Disembark at Alexandria",
        "nextEntry": "195",
        "requirements": {
          "destination": "Alexandria"
        }
      }
    ],
    "effects": {
      "skipRemainingDays": true
    },
    "traceNumbers": ["155", "173", "195"]
  },
  "140": {
    "description": "You read the following: 'Where is the Lost City of the Old Ones? Where are the treasures of the Eldritch Masters? Cursed are they, condemned by the shoggoths to lie buried, waiting in the ice, for one more turn of Aten’s Top.'",
    "choices": [
      {
        "text": "Make a Language (Hieroglyphics) roll",
        "effects": {
          "check": {
            "skill": "Language (Hieroglyphics)",
            "success": "157",
            "failure": {
              "nextEntry": "41",
              "choices": [
                {
                  "text": "Continue looking over the Occult books",
                  "nextEntry": "41"
                },
                {
                  "text": "Return to the New York Public Library",
                  "nextEntry": "74"
                }
              ]
            }
          }
        }
      }
    ],
    "traceNumbers": ["41", "157", "74"]
  },
  "141": {
    "description": "You hear thunderous snores. This room is occupied and can’t be Gliere’s room; you better try a different door.",
    "choices": [
      {
        "text": "Return to the hallway",
        "nextEntry": "52"
      }
    ],
    "traceNumbers": ["11", "52"]
  },
  "145": {
    "description": "For each hour at Miskatonic’s library, you may attempt one of the following actions.",
    "choices": [
      {
        "text": "Attempt a Library Use roll",
        "effects": {
          "time": 1,
          "check": {
            "skill": "Library Use",
            "success": "25",
            "failure": "145"
          }
        }
      },
      {
        "text": "Attempt a Spot Hidden roll",
        "effects": {
          "time": 1,
          "check": {
            "skill": "Spot Hidden",
            "success": "70",
            "failure": "145"
          }
        }
      },
      {
        "text": "Return to Miskatonic University",
        "nextEntry": "82"
      },
      {
        "text": "Go to any Arkham Location",
        "nextEntry": "Arkham Location"
      }
    ],
    "traceNumbers": ["70", "82", "143"]
  },
  "146": {
    "title": "GRAND CENTRAL STATION",
    "description": "If departing for Boston, there are two departures for Boston every day. One leaves at 8am and arrives at 3pm; the second leaves at 6pm and arrives at 12:30am. From Boston you may connect with a local train for Arkham. Wait here for your train, or go to any New York Location.",
    "choices": [
      {
        "text": "Take the 8am train to Boston (arrives at 3pm)",
        "effects": {
          "setHour": 8,
          "advanceTime": 6
        },
        "nextEntry": "64"
      },
      {
        "text": "Take the 6pm train to Boston (arrives at 12:00am)",
        "effects": {
          "setHour": 18,
          "advanceTime": 5
        },
        "nextEntry": "64"
      },
      {
        "text": "Go to any New York Location",
        "nextEntry": "New York Location"
      }
    ],
    "traceNumbers": ["64", "New York Location"]
  },
  "150": {
    "title": "Professorial Study",
    "description": "You enter and cautiously turn on a light to see a room in proper professorial confusion. Scattered about are books of myths and fables, and there are bundles of clippings from various foreign newspapers. For each hour you spend here, you can attempt one roll for one of the following skills. Each skill may be tried once daily.",
    "choices": [
      {
        "text": "Attempt an Astronomy roll",
        "nextEntry": "24",
        "effects": {
          "check": {
            "skill": "Astronomy",
            "success": "24",
            "failure": "150"
          },
          "dailyLimit": 1
        }
      },
      {
        "text": "Attempt a Science (Cryptography) roll",
        "nextEntry": "29",
        "effects": {
          "check": {
            "skill": "Science (Cryptography)",
            "success": "29",
            "failure": "150"
          },
          "dailyLimit": 1
        }
      },
      {
        "text": "Attempt a Cthulhu Mythos roll",
        "nextEntry": "121",
        "effects": {
          "check": {
            "skill": "Cthulhu Mythos",
            "success": "121",
            "failure": "150"
          },
          "dailyLimit": 1
        }
      },
      {
        "text": "Attempt an INT roll",
        "nextEntry": "32",
        "effects": {
          "check": {
            "skill": "INT",
            "success": "32",
            "failure": "150"
          },
          "dailyLimit": 1
        }
      },
      {
        "text": "Attempt a Luck roll",
        "nextEntry": "49",
        "effects": {
          "check": {
            "skill": "Luck",
            "success": "49",
            "failure": "150"
          },
          "dailyLimit": 1
        }
      },
      {
        "text": "Attempt a Spot Hidden roll",
        "nextEntry": "72",
        "effects": {
          "check": {
            "skill": "Spot Hidden",
            "success": "72",
            "failure": "150"
          },
          "dailyLimit": 1
        }
      },
      {
        "text": "Sneak out with a Stealth roll",
        "effects": {
          "check": {
            "skill": "Stealth",
            "success": "Arkham",
            "failure": "51"
          },
          "dailyLimit": 1
        }
      }
    ]
  },
  "155": {
    "description": "The library is deserted. Well, peace and quiet is just what you crave. You’re examining the newest Agatha Christie novel when a short, sullen-looking fellow enters the room, followed by a tall man wearing a cowl. You nod uneasily and then return to your book, uncomfortably aware that they are moving nearer. You look up again. The short man smiles, and pulls out a gleaming dagger.",
    "choices": [
      {
        "text": "Draw your weapon (if you have one)",
        "effects": {
          "check": {
            "skill": "DEX",
            "success": {
              "nextEntry": "155a",
              "message": "You quickly draw your weapon before the attacker strikes."
            },
            "failure": {
              "nextEntry": "155b",
              "modifyHealth": -3,
              "message": "You fail to draw your weapon in time and the attacker strikes."
            }
          }
        }
      },
      {
        "text": "Dodge the blow",
        "effects": {
          "check": {
            "skill": "Dodge",
            "success": {
              "nextEntry": "155c",
              "message": "You manage to dodge the attack and try to escape."
            },
            "failure": {
              "nextEntry": "155b",
              "modifyHealth": -3,
              "message": "You fail to dodge and are struck by the dagger."
            }
          }
        }
      }
    ],
    "traceNumbers": ["126", "139", "155a", "155b", "155c"]
  },
  "156": {
    "description": "“DEC. 20, BREMERHAVEN – The Starkweather-Moore expedition departed today under clear skies and calm seas. Despite the record cold temperatures, many came to the pier to see off the expedition.”",
    "choices": [
      {
        "text": "Go to any New York Location.",
        "nextEntry": "New York Location"
      }
    ]
  },
  "157": {
    "description": "You read about the Top of Aten, a rumored relic from the period of Akhenaten. The top, a magical device, in some sources is mentioned as the cause of the Old Kingdom’s fall. It was Akhenaten who came to possess it and who (some scholars hint) worshiped the ancient evil ones who designed it. Akhenaten’s strange disfigurement is said to have been caused by his meddling in bizarre magical rites.",
    "choices": [
      {
        "text": "Continue looking over the Occult books",
        "nextEntry": "41",
        "advanceTime": 1
      },
      {
        "text": "Return to the New York Public Library",
        "nextEntry": "74",
        "advanceTime": 1
      }
    ],
    "traceNumbers": ["140"]
  },
  "159": {
    "description": "It is said that the spirits of the Pharaohs haunt the pyramids, and that some unfortunates even have seen them.",
    "choices": [
      {
        "text": "Make a Spot Hidden roll",
        "effects": {
          "check": {
            "skill": "Spot Hidden",
            "success": {
              "nextEntry": "182",
              "advanceTime": 1
            },
            "failure": {
              "nextEntry": "159_fail",
              "advanceTime": 1
            }
          }
        }
      },
      {
        "text": "Continue looking over the Occult books",
        "nextEntry": "41",
        "advanceTime": 1
      },
      {
        "text": "Return to the New York Public Library",
        "nextEntry": "74",
        "advanceTime": 1
      }
    ],
    "traceNumbers": ["41"]
  },
  "161": {
    "description": "You get specific directions to the Fuzira Marketplace. Two alternate names for the marketplace run through your mind: 'The place where anything can be lost or gained,' and, 'the place where souls are bartered.' You idly thumb through the volume. You think you would like to go to Egypt.",
    "choices": [
      {
        "text": "Keep looking around the Library",
        "nextEntry": "74"
      }
    ],
    "traceNumbers": ["85"]
  },
  "163": {
    "description": "“Instances of ‘Dementia Antarctica’ have been experienced by many parties exploring the frozen continent. The most recent and vivid account was rendered by the disaster-plagued journey of Lake to the unexplored northwest regions. The bizarre reports even shocked people familiar with the phenomenon. The rescue party succumbed to the isolation and cold, and all survivors spent months in sanitariums babbling about lost cities and subterranean horrors. Recently, specialists have suggested that an enriched diet will prevent such terrible delusions.”",
    "choices": [
      {
        "text": "Attempt a Luck roll",
        "effects": {
          "check": {
            "skill": "Luck",
            "success": {
              "nextEntry": "184"
            },
            "failure": "138"
          }
        }
      },
      {
        "text": "Continue your research into other topics",
        "nextEntry": "138"
      }
    ],
    "traceNumbers": ["138"]
  },
  "167": {
    "description": "You hear a knock at your cabin door. 'Cabin steward, sir. May I make up the room?'",
    "choices": [
      {
        "text": "Tell the steward to come back later",
        "nextEntry": "8"
      },
      {
        "text": "Let the steward in",
        "nextEntry": "47"
      },
      {
        "text": "Move on a day",
        "nextEntry": "187",
        "requirements": {
          "hasVisited": "167"
        },
        "effects": {
          "dayAdvance": 1
        }
      }
    ],
    "traceNumbers": ["73", "171"]
  },
  "168": {
    "description": "The archaeological team at the National Museum in Athens have reported on the Karpathos Device, noting the inexplicable markings on its surfaces and the complex network of gears and linkages. The team has established that the Device is at least 2,000 years old, although some suggest it might hold a more ancient date. The report implies an ancient level of technical achievement previously undreamt of by scholars. Cryptic Greek inscriptions were found on the outside edges of some gears, while some interior sections were marked with unusual Egyptian hieroglyphics. The team makes no guess about the function of the Device.",
    "choices": [
      {
        "text": "If in Arkham",
        "requirements": {
          "currentLocale": "Arkham"
        },
        "nextEntry": "60"
      },
      {
        "text": "If in Athens",
        "requirements": {
          "currentLocale": "Athens"
        },
        "nextEntry": "176"
      },
      {
        "text": "If in Cairo",
        "requirements": {
          "currentLocale": "Egypt"
        },
        "nextEntry": "206"
      }
    ],
    "traceNumbers": ["60", "176", "206"]
  },
  "171": {
    "description": "You are reflecting on your activities for the day.",
    "choices": [
      {
        "text": "Rest in Room (am)",
        "nextEntry": "167",
        "requirements": {
          "hasNotVisited": "167",
          "scheduledActivity": {
            "am": "Rest in Room"
          }
        }
      },
      {
        "text": "Oil Painting (pm)",
        "nextEntry": "96",
        "requirements": {
          "hasNotVisited": "96",
          "scheduledActivity": {
            "pm": "Oil Painting"
          }
        }
      },
      {
        "text": "Time for dinner",
        "nextEntry": "385"
      },
      {
        "text": "Cocktails (night)",
        "nextEntry": "203",
        "requirements": {
          "hasNotVisited": "203",
          "scheduledActivity": {
            "night": "Cocktails"
          }
        }
      }
    ],
    "traceNumbers": ["132", "142", "187", "193"]
  },
  "96": {
    "description": "While you enjoy painting on deck, you notice one of the female passengers quietly weeping. As you move to offer her comfort, you are transfixed by what she is painting: strange, stalk-like creatures standing in a weird landscape of oddly-angled buildings bathed in purple light. The creatures seem to be screaming, though they have no visible mouths. Horrified, you move away without saying anything.",
    "choices": [
      {
        "text": "Return to your activities",
        "nextEntry": "171"
      }
    ],
    "traceNumbers": ["171"]
  },
  "203": {
    "description": "As you sit at the bar, an elderly man nods to you and quietly asks if he may join you.",
    "choices": [
      {
        "text": "Allow the man to join you",
        "nextEntry": "142"
      },
      {
        "text": "Politely decline",
        "nextEntry": "132"
      }
    ],
    "traceNumbers": ["142", "132"]
  },
  "132": {
    "description": "The man leaves you alone.",
    "choices": [
      {
        "text": "Rest for the night",
        "nextEntry": "187"
      }
    ],
    "traceNumbers": ["203"]
  },
  "142": {
    "description": "“Martini, straight up, please.” He turns to you. “I couldn’t help but notice, old friend, that some strange people seem to follow you. A word of advice: stay off the deck, suspect everyone, stay out of the library and other lonely spots. I’ve seen these assassin types in action, by God.” You have never seen him before. He then talks about chess for a while, finishes his martini, and leaves. You never see him again.",
    "choices": [
      {
        "text": "Move on to the next day",
        "nextEntry": "187",
        "effects": {
          "setHour": 23,
          "advanceTime": 6
        }
      }
    ],
    "traceNumbers": ["203", "187"]
  },
  "385": {
    "description": "You are invited by your dinner partners to play poker. You're on a roll and win $17.",
    "choices": [
      {
        "text": "Move on to the next day",
        "nextEntry": "187",
        "effects": {
          "setHour": 23,
          "advanceTime": 6
        }
      }
    ],
    "traceNumbers": ["171", "187"]
  },
  "172": {
    "description": "Tibor Gliere’s suicide stunned Miskatonic University. The disappearance of Professor Grunewald under suspicious circumstances has set rumors flying. Dean Wilcox is puzzled, upset, and unwilling to give an interview, but his secretary confides that Dean Wilcox hasn’t a clue as to what is going on.",
    "choices": [
      {
        "text": "Go to newspaper",
        "nextEntry": "60"
      }
    ],
    "traceNumbers": ["60"]
  },
  "176": {
    "description": "You see the fabulous treasures of ancient Greece. You also find the stand where the Karpathos Device, replaced at the moment by a drawing and a photograph, is normally kept. The notes speculate that the Karpathos Device is some kind of astronomical clock designed to aid priests. Other scholars feel it may have been designed to actually create something material. Still others see it as merely an elaborate amusement for some wealthy noble or merchant. The origin of the device is not uncertain, nor has the substance of which it is made been determined.",
    "choices": [
      {
        "text": "Learn more information on the Device.",
        "nextEntry": "168"
      },
      {
        "text": "Make a Luck roll",
        "effects": {
          "check": {
            "skill": "Luck",
            "success": "166",
            "failure": "118"
          }
        }
      },
      {
        "text": "Go to any Athens Location",
        "nextEntry": "Athens Location"
      }
    ],
    "traceNumbers": ["118", "166", "168"]
  },
  "178": {
    "description": "The Karpathos Device has arrived safely in Cairo for an extended display. Curator Amet Keh is reported as thrilled to have it on loan.",
    "choices": [
      {
        "text": "There's more to learn here.",
        "requirements": {
          "dateAfter": "1931-10-31"
        },
        "nextEntry": "190"
      },
      {
        "text": "Go to any New York Location.",
        "requirements": {
          "dateBefore": "1931-10-31",
          "currentLocale": "New York"
        },
        "nextEntry": "New York Location"
      }
    ]
  },
  "182": {
    "description": "You find the symbol of the cult of Aten (see image below), the so-called Egyptian death cult. You think that you may have seen that shape before.",
    "image": "src/assets/images/clues/clue182.png",
    "choices": [
      {
        "text": "Continue looking over the Occult books",
        "nextEntry": "41",
        "advanceTime": 1
      },
      {
        "text": "Keep looking around the Library",
        "nextEntry": "74",
        "advanceTime": 1
      }
    ],
    "traceNumbers": ["159"]
  },
  "184": {
    "description": "Preparations are said to continue apace for the Starkweather-Moore expedition to Antarctica. The expedition will retrace the steps of the ill-fated Lake-Douglas party. The new expedition sets sail in December, from Bremerhaven.",
    "choices": [
      {
        "text": "Continue your research into other topics",
        "nextEntry": "138"
      },
      {
        "text": "Keep looking around the Library",
        "nextEntry": "74"
      }
    ],
    "traceNumbers": ["163"]
  },
  "186": {
    "description": "“Oh. Resign? Ahem. My dear fellow, I apologize! I should have recognized how serious you were. Go! Save poor Gliere’s hide. I know you’ll do it speedily and judiciously. The University will certainly pay for your round-trip ticket.” As you leave, you hear footsteps move quickly away from the door. But when you look out, the hallway is empty.",
    "choices": [
      {
        "text": "Return to the library",
        "nextEntry": "82"
      },
      {
        "text": "Go to any Arkham Location",
        "nextEntry": "Arkham Location"
      }
    ],
    "traceNumbers": ["100"]
  },
  "187": {
    "title": "CUNARD SHIP ACTIVITY TABLE",
    "description": "The CUNARD liners are truly luxurious, with spacious rooms in nearly every class, remarkable recreation facilities, and superb cuisine. While you are aboard the liner, suspend hourly record keeping, but keep track of days. Resume hourly record keeping when you disembark at Athens or Alexandria.",
    "schedule": {
      "firstSunday": "73",
      "firstMonday": "109",
      "Tuesday": "126",
      "Wednesday": "148",
      "Thursday": "148",
      "Friday": "126",
      "Saturday": "171",
      "secondSunday": "171",
      "secondMonday": "173",
      "secondTuesday": "195"
    },
    "specialInstructions": [
      "On the second Monday, you're in Athens: ignore any checks that day if you're continuing to Alexandria. If you disembark at Athens, resume hourly recordkeeping at noon.",
      "On the second Tuesday, if you stayed aboard, you're in Alexandria: you have no checks that day either, but resume hourly recordkeeping at 1pm."
    ],
    "shipActivities": {
      "Bingo": ["pm", "night"],
      "Bridge": ["pm", "night"],
      "Cinema": ["am", "pm", "night"],
      "Cocktails": ["pm", "night"],
      "Deck Tennis": ["am", "pm"],
      "Library": ["am", "pm", "night"],
      "Mah Jong": ["am", "pm", "night"],
      "Nightclub": ["night"],
      "Oil Painting": ["am", "pm"],
      "Ping Pong": ["am", "pm", "night"],
      "Rest on Deck Chairs": ["am", "pm"],
      "Rest in Room": ["am", "pm", "night"],
      "Sauna": ["am", "pm", "night"],
      "Ship's Tour": ["pm"],
      "Shopping": ["am", "pm"],
      "Shuffleboard": ["am", "pm"],
      "Stroll Decks": ["am", "pm", "night"]
    },
    "choices": [],
    "traceNumbers": [
      "69",
      "83",
      "104",
      "106",
      "109",
      "115",
      "126",
      "132",
      "142",
      "167",
      "189",
      "385",
      "579",
      "590",
      "New York Location"
    ]
  },
  "190": {
    "description": "The disappearance of the Karpathos Device and of Amet Keh baffles the Egyptian authorities. Mr. Pisistratos of the National Museum in Athens will not comment.",
    "choices": [
      {
        "text": "There's more to learn here.",
        "requirements": {
          "dateAfter": "1931-12-01"
        },
        "nextEntry": "156"
      },
      {
        "text": "Go to any New York Location.",
        "requirements": {
          "dateBefore": "1931-12-01",
          "currentLocale": "New York"
        },
        "nextEntry": "New York Location"
      }
    ]
  },
  "206": {
    "title": "CAIRO MUSEUM",
    "description": "The museum is open 9am to noon, and from 3pm-6pm daily. Three exhibits in this great museum might interest you:",
    "choices": [
      {
        "text": "For Treasures from the Pyramids",
        "nextEntry": "290"
      },
      {
        "text": "For Tombs of the Ancients",
        "nextEntry": "236"
      },
      {
        "text": "For the Karpathos Device",
        "nextEntry": "209"
      },
      {
        "text": "Interview the curator, Amet Keh",
        "nextEntry": "302"
      },
      {
        "text": "Go to a Cairo location",
        "nextEntry": "Egypt Location"
      }
    ],
    "traceNumbers": ["Egypt Location"]
  },
  "208": {
    "description": "The symbol displays a strange mucous-like creature, covered in eyes and mouths—it looks like a shoggoth! A hideous monster capable of transforming its great mass into all manner of tools and shapes.",
    "choices": [
      {
        "text": "Keep looking around the room",
        "nextEntry": "150"
      }
    ],
    "traceNumbers": ["282"]
  },
  "209": {
    "description": "The Karpathos Device is there, with interesting background information. Its appearance is remarkably modern, resembling aluminum but obviously of great strength. Its enclosure is electrically guarded to prevent theft. Need a refresher on the Karpathos Device?",
    "choices": [
      {
        "text": "Refresh your memory about the Device.",
        "nextEntry": "168"
      },
      {
        "text": "Back to the main area of the museum.",
        "nextEntry": "206"
      },
      {
        "text": "Explore other ideas about the Device.",
        "nextEntry": "211"
      }
    ],
    "traceNumbers": ["206"]
  },
  "211": {
    "description": "Having come so far and seen much danger, you believe the fate of the world might depend on your actions. How could you not attempt to secure the Karpathos Device?",
    "choices": [
      {
        "text": "Attempt the theft now.",
        "nextEntry": "229"
      },
      {
        "text": "Hide until the museum closes and then attempt the theft.",
        "nextEntry": "281"
      },
      {
        "text": "Reconsider your actions.",
        "nextEntry": "206"
      }
    ],
    "traceNumbers": ["209"]
  },
  "212": {
    "description": "You decipher four words from the hieroglyphics: 'ones,' 'spin,' 'city,' and 'top.' The rest baffle you.",
    "choices": [
      {
        "text": "Attempt a History roll to understand more",
        "effects": {
          "time": 1,
          "check": {
            "skill": "History",
            "success": "282",
            "failure": "150"
          }
        }
      }
    ],
    "traceNumbers": ["124"]
  },
  "229": {
    "description": "The Karpathos Device is secured within a thick glass enclosure with an alarm system. What do you do?",
    "choices": [
      {
        "text": "Try smashing the glass.",
        "nextEntry": "280"
      },
      {
        "text": "Leave it be.",
        "nextEntry": "206"
      }
    ],
    "traceNumbers": ["211"]
  },
  "263": {
    "description": "In the dim yellow night-lights of the museum, you can scarcely believe your eyes. The place has come alive with undead in many forms: from human mummies to megatheria in the natural history wing, all bizarrely returned to life! Everywhere you see the ominous, jerky shuffle of half-dead things. Instinctively you understand that these entities want to snuff out your life and baffle your purpose. You edge quietly along the halls, intent upon your escape from this hair-raising peril. To escape, you need to make successful Spot Hidden, Dodge, and INT rolls respectively, without missing any of the rolls.",
    "choices": [
      {
        "text": "Attempt to Spot Hidden",
        "nextEntry": "263a"
      }
    ]
  },
  "274": {
    "description": "Police cars come screeching up to the museum. You have several options, and should think about them all before choosing one:",
    "choices": [
      {
        "text": "Try to sneak away",
        "effects": {
          "check": {
            "skill": "Stealth",
            "success": "301",
            "failure": "315"
          }
        }
      },
      {
        "text": "Talk your way out of this",
        "effects": {
          "check": {
            "skill": "Fast Talk",
            "success": "301",
            "failure": "315"
          }
        }
      },
      {
        "text": "Persuade them that you belong here",
        "effects": {
          "check": {
            "skill": "Persuade",
            "success": "301",
            "failure": "315"
          }
        }
      },
      {
        "text": "Admit your actions to the police",
        "nextEntry": "315"
      }
    ],
    "traceNumbers": ["263"]
  },
  "276": {
    "description": "But what is that sound you hear? Terror clutches your heart.",
    "choices": [
      {
        "text": "Attempt to escape the horror",
        "nextEntry": "263"
      }
    ],
    "traceNumbers": ["280"]
  },
  "280": {
    "description": "There is toughened glass around the Karpathos Device. Perhaps you have a tool or weapon, or something you can throw at it?",
    "choices": [
      {
        "text": "Break the glass (not at night)",
        "requirements": {
          "isNotNight": true
        },
        "nextEntry": "230a"
      },
      {
        "text": "Break the glass (at night)",
        "requirements": {
          "isNight": true
        },
        "nextEntry": "276"
      }
    ],
    "traceNumbers": ["229", "281"]
  },
  "281": {
    "description": "You decide to wait out the closing hours hidden in the shadows of the museum. If you fail, you will be ushered out.",
    "choices": [
      {
        "effects": {
          "check": {
            "failure": "Egypt",
            "skill": "Stealth",
            "success": "280"
          }
        },
        "text": "Attempt to hide and wait.",
        "nextEntry": "281"
      }
    ],
    "traceNumbers": ["211"]
  },
  "282": {
    "description": "You understand four more hieroglyphs: 'Akhenaten,' 'tomb,' 'sunrise,' and 'secret.'",
    "choices": [
      {
        "text": "Attempt a Cthulhu Mythos roll",
        "effects": {
          "check": {
            "skill": "Cthulhu Mythos",
            "success": "208",
            "failure": "150"
          }
        }
      }
    ],
    "traceNumbers": ["212"]
  },
  "293": {
    "description": "You have evaded several of the guards and the Karpathos Device is in your possession, decide your next action carefully.",
    "choices": [
      {
        "text": "Decide what to do with the Device",
        "nextEntry": "249a"
      }
    ],
    "traceNumbers": ["230", "301"]
  },
  "301": {
    "description": "You've managed to escape with the Device. Now you must decide how to proceed.",
    "choices": [
      {
        "text": "Proceed with your escape, go to 293.",
        "nextEntry": "293"
      },
      {
        "text": "Surrender to the authorities, go to 315.",
        "nextEntry": "315"
      }
    ],
    "traceNumbers": ["274"]
  },
  "315": {
    "description": "You come forward, turn yourself into the police and confess everything. The Karpathos Device is taken from you and you rot in a hellish sanatorium for a long time. Eventually you are released.",
    "choices": [
      {
        "text": "Face the consequences.",
        "nextEntry": "574"
      }
    ],
    "traceNumbers": ["249a", "274", "301"]
  },
  "554": {
    "choices": [
      {
        "nextEntry": "New York Location",
        "text": "Go to any New York Location"
      },
      {
        "nextEntry": "Athens Location",
        "text": "Go to any Athens Location"
      },
      {
        "nextEntry": "Alexandria Location",
        "text": "Go to any Egypt Location"
      },
      {
        "nextEntry": "Bremen Location",
        "text": "Go to any Bremen Location"
      }
    ],
    "description": "Your ship, the USS Rochester, lies snugly at anchor. Ordinarily, as the dashing Lt. Devon Wilson, you’d be storming the gangplank to start your month’s leave with a spree, but Nora’s alarming telegrams abruptly stopped exactly seven days ago, while you were still at sea. You must find her. You study her photo in its Deco frame and then carefully pack it. You’d give everything you have to get her back. As you pack, a chill runs down your spine: Gliere was a suicide, Grunewald and Holt mysteriously lost, and now Nora! You decide to include your service revolver in your bags, and you resolve to equip yourself for any eventuality at that nearby store. The Rochester is in the port location you wish; choose from: New York, Athens, Alexandria, or Bremen. Pick up any equipment or supplies you want and then go to any location below.",
    "title": "USS Rochester",
    "traceNumbers": ["START"]
  },
  "574": {
    "description": "You have failed! Depending where you are, your experiences vary. Coastline lines suffer dramatic flooding and panic ensues. Scientists claim the Earth has somehow shifted on its axis and that terrible consequences will follow. Indeed, they do. Storms of primeval force sweep the continents. Melting polar ice fuels the flooding, while terrifying ice storms strike at the heart of civilization. Once it begins, much of the world of humankind is destroyed within days. The City of the Old Ones has a new master, and the whole world pays for your failure. Your revolver has a bullet in the chamber. Whether you choose to use it or not, it is ... THE END.",
    "choices": [
      {
        "text": "GAME OVER",
        "effects": {
          "endGame": true
        }
      }
    ],
    "traceNumbers": [
      "100",
      "173",
      "315",
      "525",
      "529",
      "530",
      "541",
      "542",
      "566",
      "567"
    ]
  },
  "583": {
    "title": "HOTEL",
    "description": "What a find! This hotel is cheap, roomy, warm, spacious, comfortable, and clean.",
    "choices": [
      {
        "text": "Get a room for the night",
        "effects": {
          "setHour": 6
        },
        "nextEntry": "New York Location"
      },
      {
        "text": "Keep exploring New York",
        "nextEntry": "New York Location"
      }
    ],
    "traceNumbers": ["New York Location"]
  },
  "585": {
    "title": "HOSPITAL",
    "description": "You get tender loving care at the hospital.",
    "choices": [
      {
        "text": "Make a Luck roll for recovery",
        "requirements": {
          "notFullHealth": true
        },
        "effects": {
          "check": {
            "skill": "Luck",
            "success": {
              "nextEntry": "585a",
              "modifyHealth": "2D3",
              "message": "Your recovery is swift and effective. You gain 2D3 hit points for the first day."
            },
            "failure": {
              "nextEntry": "585b",
              "modifyHealth": "1D3",
              "message": "Recovery is slow, but you still gain 1D3 hit points for the first day."
            }
          }
        }
      },
      {
        "text": "Leave the hospital",
        "nextEntry": "585_exit"
      }
    ],
    "traceNumbers": [
      "Arkham Location",
      "New York Location",
      "Athens Location",
      "Egypt Location",
      "Bremen Location",
      "The Dark Sea",
      "Antarctic Base Camp"
    ]
  },
  "586": {
    "description": "Small fast-food stands occur in every city: hot dogs, falafel, and so on.",
    "choices": [
      {
        "text": "Buy and eat some food",
        "effects": {
          "diceRoll": "1D10",
          "outcomes": {
            "1": {
              "description": "That food really hit the spot!",
              "nextEntry": "New York"
            },
            "2-10": {
              "description": "The food tasted all right at the time, but now your stomach is churning.",
              "nextEntry": "12"
            }
          }
        }
      },
      {
        "text": "Keep exploring",
        "nextEntry": "New York"
      }
    ],
    "traceNumbers": ["12"]
  },
  "593": {
    "choices": [
      {
        "nextEntry": "Arkham Location",
        "text": "Finish meal"
      }
    ],
    "description": "A small diner offering basic meals. It's a place to sit down and have a meal while gathering your thoughts.",
    "title": "BEE'S DINER",
    "traceNumbers": ["Arkham Location"]
  },
  "7a": {
    "description": "You realize that you have no idea where Gliere's room is. You go upstairs. All the doors are closed; none have names on them.",
    "choices": [
      {
        "text": "Try one of the doors",
        "nextEntry": "51"
      },
      {
        "text": "Leave the house",
        "nextEntry": "Arkham Location"
      }
    ],
    "traceNumbers": ["7"]
  },
  "10a": {
    "title": "Quick Response",
    "description": "You react swiftly, getting your weapon ready before the stranger can fully attack.",
    "choices": [
      {
        "text": "Engage in combat",
        "nextEntry": "10d"
      }
    ]
  },
  "10b": {
    "title": "Caught Off Guard",
    "description": "You fail to react in time. The man strikes first with his knife, aiming a deadly blow.",
    "choices": [
      {
        "text": "Fight back",
        "nextEntry": "10d"
      }
    ],
    "effects": {
      "health": {
        "diceRoll": "1D100",
        "success": -6,
        "failure": 0,
        "threshold": 50
      }
    }
  },
  "10c": {
    "title": "Knife Wound",
    "description": "The knife pierces through, wounding you severely. You must continue fighting for your life.",
    "choices": [
      {
        "text": "Continue fighting",
        "nextEntry": "10d"
      }
    ]
  },
  "10d": {
    "title": "Combat Continues",
    "description": "The battle rages on. Either party must fight until one can no longer continue.",
    "choices": [
      {
        "text": "Attempt to Dodge",
        "effects": {
          "check": {
            "skill": "Dodge",
            "success": "10f",
            "failure": {
              "nextEntry": "10d",
              "damage": "1D6",
              "message": "The stranger lets loose a shot as you fail to dodge."
            }
          }
        }
      },
      {
        "text": "Fight",
        "nextEntry": "10d",
        "effects": {
          "combat": {
            "opponent": {
              "name": "Mysterious Stranger",
              "attackChance": "50%",
              "damage": "1D6",
              "dex": 60,
              "health": 10,
              "maxHealth": 10
            },
            "win": "10e",
            "lose": "end"
          },
          "advanceTime": 0
        }
      }
    ]
  },
  "10e": {
    "description": "You were able to defeat the enemy.",
    "choices": [
      {
        "text": "Rest for the night",
        "nextEntry": "187",
        "effects": {
          "setHour": 23,
          "advanceTime": 6
        }
      }
    ]
  },
  "10f": {
    "description": "You slipped away from the enemy.",
    "choices": [
      {
        "text": "Rest for the night",
        "nextEntry": "187",
        "effects": {
          "setHour": 23,
          "advanceTime": 6
        }
      }
    ]
  },
  "11b": {
    "description": "Before you enter, you sense something beyond the door. You put your ear to the door, but are startled by someone behind you!",
    "choices": [
      {
        "text": "Someone heard you!",
        "nextEntry": "51"
      }
    ],
    "traceNumbers": ["52"]
  },
  "28a": {
    "description": "You've managed to enter the Harding House without causing too much disturbance. Now, you must navigate quietly.",
    "choices": [
      {
        "text": "Attempt Stealth to scout the house",
        "effects": {
          "check": {
            "skill": "Stealth",
            "success": "52",
            "failure": "51"
          }
        }
      }
    ]
  },
  "73a": {
    "description": "The ship is huge, but nothing strikes you as out of the ordinary.",
    "choices": [
      {
        "text": "Proceed to the next day",
        "nextEntry": "187",
        "effects": {
          "setHour": 23,
          "advanceTime": 6
        }
      }
    ]
  },
  "83a": {
    "description": "You ask about the foreign pari seen on deck, but no one seems to know what you are talking about.",
    "choices": [
      {
        "text": "Proceed to the next day",
        "nextEntry": "187",
        "effects": {
          "setHour": 23,
          "advanceTime": 6
        }
      }
    ]
  },
  "106a": {
    "title": "Combat Continues",
    "description": "The battle rages on. Either party must fight until one can no longer continue.",
    "choices": [
      {
        "text": "Attempt to Dodge",
        "effects": {
          "check": {
            "skill": "Dodge",
            "success": "47b",
            "failure": {
              "nextEntry": "106a",
              "damage": "1D6",
              "message": "The stranger lets loose a shot as you fail to dodge."
            }
          }
        }
      },
      {
        "text": "Fight",
        "nextEntry": "10d",
        "effects": {
          "combat": {
            "opponent": {
              "name": "Mysterious Stranger",
              "attackChance": "50%",
              "damage": "1D6",
              "dex": 60,
              "health": 10,
              "maxHealth": 10
            },
            "win": "47b",
            "lose": "end"
          },
          "advanceTime": 0
        }
      }
    ]
  },
  "137b": {
    "description": "Just as you become aware of people behind you, two massive, leathery hands clamp around your neck like a vise and start to strangle you.",
    "choices": [
      {
        "text": "Try to break free with a Hard Strength roll",
        "effects": {
          "check": {
            "skill": "STR",
            "difficulty": "hard",
            "tries": "1D6",
            "success": {
              "nextEntry": "126",
              "message": "You succeed in breaking free and run out of the theater to safety."
            },
            "failure": {
              "nextEntry": "137c",
              "message": "You have been murdered... THE END."
            }
          }
        }
      }
    ],
    "traceNumbers": ["137"]
  },
  "137c": {
    "description": "You have failed all your attempts to escape. As the strangulation intensifies, your vision fades... THE END.",
    "choices": [
      {
        "text": "GAME OVER",
        "effects": {
          "endGame": true
        }
      }
    ],
    "traceNumbers": ["137b"]
  },
  "141b": {
    "description": "You hear thunderous snores. This room is occupied and can’t be Gliere’s room; you better try a different door. Uh oh! Someone's coming!",
    "choices": [
      {
        "text": "Someone heard you!",
        "nextEntry": "51"
      }
    ],
    "traceNumbers": ["11", "52"]
  },
  "148": {
    "description": "You are enjoying another gorgeous day on the ship.",
    "choices": [
      {
        "text": "Stroll Decks (am)",
        "nextEntry": "135",
        "requirements": {
          "scheduledActivity": {
            "am": "Stroll Decks"
          },
          "hasNotVisited": "135"
        }
      },
      {
        "text": "Play Shuffleboard (pm)",
        "nextEntry": "135",
        "requirements": {
          "scheduledActivity": {
            "pm": "Shuffleboard"
          },
          "hasNotVisited": "135"
        }
      },
      {
        "text": "Stroll Decks (night)",
        "nextEntry": "135",
        "requirements": {
          "scheduledActivity": {
            "night": "Stroll Decks"
          },
          "hasNotVisited": "135"
        }
      },
      {
        "text": "Who is that person over there?",
        "nextEntry": "579",
        "requirements": {
          "hasVisited": "135"
        }
      },
      {
        "text": "Move on to the next day",
        "nextEntry": "187",
        "effects": {
          "setHour": 23,
          "advanceTime": 6
        }
      }
    ],
    "traceNumbers": ["135", "187", "193", "579"]
  },
  "135": {
    "description": "As you walk down a corridor, you feel uneasy. Attempt a Spot Hidden roll to see if you notice something strange.",
    "choices": [
      {
        "text": "Make a Spot Hidden roll",
        "effects": {
          "check": {
            "skill": "Spot Hidden",
            "success": {
              "nextEntry": "135a"
            },
            "failure": {
              "nextEntry": "106",
              "message": "You fail to notice anything unusual and continue walking. Suddenly, there is movement to your side and a small man rushes at you."
            }
          }
        }
      }
    ],
    "traceNumbers": ["106", "148"]
  },
  "135a": {
    "description": "You notice a small Egyptian fellow lurking ahead of you. You may have seen him before. He holds something in his hand shiny in his hand. You are down a side passage now and have quickened your pace. Now you hear his footsteps scurry after you. Is it only your imagination, or are the corridor lights dimming?",
    "choices": [
      {
        "text": "Make a Know (EDU) roll",
        "effects": {
          "check": {
            "skill": "EDU",
            "success": {
              "nextEntry": "148b",
              "message": "You successfully reach the deck and the safety of the promenade. You are ready to call it a day and get some rest."
            },
            "failure": {
              "nextEntry": "106",
              "message": "You take a wrong turn and find yourself at a locked hatch labeled 'No Admittance.'"
            }
          }
        }
      }
    ],
    "traceNumbers": ["106", "187"]
  },
  "148b": {
    "description": "",
    "choices": [
      {
        "text": "Rest for the night",
        "nextEntry": "187",
        "effects": {
          "setHour": 23,
          "advanceTime": 6
        }
      }
    ],
    "traceNumbers": ["148"]
  },
  "579": {
    "description": "A chance flirtation leads you to the ship’s casino. You find yourself at the baccarat table, and luck is on your side. You win $87!",
    "choices": [
      {
        "text": "Celebrate your win",
        "nextEntry": "187",
        "effects": {
          "setHour": 23,
          "advanceTime": 6,
          "message": "You don't remember much about last night, but what you do makes you grin."
        }
      }
    ],
    "traceNumbers": ["148", "187"]
  },
  "150b": {
    "title": "Professorial Study",
    "description": "You enter and cautiously turn on a light to see a room in proper professorial confusion. Scattered about are books of myths and fables, and there are bundles of clippings from various foreign newspapers. You hear shuffling behind you!",
    "choices": [
      {
        "text": "Someone heard you!",
        "nextEntry": "51"
      }
    ]
  },
  "155a": {
    "description": "You draw your weapon and prepare to fight. Make a DEX roll to attack first.",
    "choices": [
      {
        "text": "Attack with your weapon",
        "effects": {
          "check": {
            "skill": "DEX",
            "success": {
              "nextEntry": "155b",
              "message": "You manage to hit the short man and take 1D6 damage."
            },
            "failure": {
              "nextEntry": "155b",
              "message": "You miss and the short man hits you."
            }
          }
        }
      }
    ]
  },
  "155b": {
    "description": "The short man stabs you with his dagger. You must fight or dodge to survive.",
    "choices": [
      {
        "text": "Fight back",
        "nextEntry": "155b",
        "effects": {
          "combat": {
            "opponent": {
              "name": "Short Man",
              "attackChance": "50%",
              "damage": "1D6",
              "health": 8,
              "maxHealth": 8
            },
            "win": "155c",
            "lose": "155e"
          }
        }
      },
      {
        "text": "Try to dodge and escape",
        "effects": {
          "check": {
            "skill": "Dodge",
            "success": {
              "nextEntry": "155c",
              "message": "You dodge the blow and try to escape."
            },
            "failure": {
              "nextEntry": "155b",
              "damage": "1D6",
              "message": "The stranger lets loose a shot as you fail to dodge."
            }
          }
        }
      }
    ]
  },
  "155c": {
    "description": "The short man falls, but the tall hooded figure blocks the exit. As you launch a desperate series of attacks to make your escape, you see your blows (knife, bullets, etc.) go through him into the bulkheads, as if he were a ghost! His inhuman glowing eyes are now visible within the gloom of the cowl, and you feel a deathly chill in the air.",
    "choices": [
      {
        "text": "Make a Sanity roll",
        "effects": {
          "check": {
            "skill": "Sanity",
            "success": {
              "nextEntry": "139",
              "message": "You manage to keep your sanity and attempt to escape."
            },
            "failure": {
              "sanity": "1D6",
              "nextEntry": "155d"
            }
          }
        }
      }
    ]
  },
  "155d": {
    "description": "His hands reach out towards you!",
    "choices": [
      {
        "text": "Make a Luck roll",
        "effects": {
          "check": {
            "skill": "Luck",
            "success": {
              "nextEntry": "139",
              "message": "You narrowly escape the horrifying figure."
            },
            "failure": {
              "modifyHealth": -100,
              "nextEntry": "155e"
            }
          }
        }
      }
    ]
  },
  "155e": {
    "description": "The tall figure’s hands close around your throat, and you feel a cold, clammy grip on your soul. You are dead.",
    "choices": [
      {
        "text": "GAME OVER",
        "effects": {
          "endGame": true
        }
      }
    ]
  },
  "159_fail": {
    "description": "You failed the Spot Hidden roll. You can continue looking through the Occult books, or return to the New York Public Library.",
    "choices": [
      {
        "text": "Continue looking over the Occult books",
        "nextEntry": "41",
        "advanceTime": 1
      },
      {
        "text": "Return to the New York Public Library",
        "nextEntry": "74",
        "advanceTime": 1
      }
    ],
    "traceNumbers": ["159"]
  },
  "230_guard_1_action": {
    "description": "The first guard reacts. Roll 1D6 to determine the guard's action.",
    "choices": [
      {
        "text": "Roll for first guard's action",
        "effects": {
          "diceRoll": "1D6",
          "outcomes": {
            "6": {
              "description": "The first guard attempts to grab you.",
              "nextEntry": "230_guard_1_combat"
            },
            "1-5": {
              "description": "The first guard shoots at you, causing 1D8 damage.",
              "damage": "1D8",
              "nextEntry": "230_guard_2_action"
            }
          }
        }
      }
    ],
    "traceNumbers": ["230b", "230c"]
  },
  "230_guard_1_combat": {
    "description": "The first guard has grabbed you! Fight back with the Karpathos Device or try to dodge.",
    "choices": [
      {
        "text": "Fight with the Device",
        "effects": {
          "check": {
            "skill": "Fighting (Brawl)",
            "success": "230_guard_2_action",
            "failure": "574"
          }
        }
      },
      {
        "text": "Attempt to dodge",
        "effects": {
          "check": {
            "skill": "Dodge",
            "success": "230_guard_2_action",
            "failure": "574"
          }
        }
      }
    ],
    "traceNumbers": ["230_guard_1_action"]
  },
  "230_guard_2_action": {
    "description": "Now, you face the second guard. Roll 1D6 to see his reaction.",
    "choices": [
      {
        "text": "Roll for second guard's action",
        "effects": {
          "diceRoll": "1D6",
          "outcomes": {
            "6": {
              "description": "The second guard attempts to grab you.",
              "nextEntry": "230_guard_2_combat"
            },
            "1-5": {
              "description": "The second guard shoots at you, causing 1D8 damage.",
              "damage": "1D8",
              "nextEntry": "230_guard_3_action"
            }
          }
        }
      }
    ],
    "traceNumbers": ["230_guard_1_action", "230_guard_1_combat"]
  },
  "230_guard_2_combat": {
    "description": "The second guard has grabbed you! Decide your next move.",
    "choices": [
      {
        "text": "Fight back using the Device",
        "effects": {
          "check": {
            "skill": "Fighting (Brawl)",
            "success": "230_guard_3_action",
            "failure": "574"
          }
        }
      },
      {
        "text": "Try to dodge the grab",
        "effects": {
          "check": {
            "skill": "Dodge",
            "success": "230_guard_3_action",
            "failure": "574"
          }
        }
      }
    ],
    "traceNumbers": ["230_guard_2_action"]
  },
  "230_guard_3_action": {
    "description": "You now confront the third and final guard. Roll 1D6 to determine his actions.",
    "choices": [
      {
        "text": "Roll for third guard's action",
        "effects": {
          "diceRoll": "1D6",
          "outcomes": {
            "6": {
              "description": "The third guard tries to grab you.",
              "nextEntry": "230_guard_3_combat"
            },
            "1-5": {
              "description": "The third guard shoots, causing 1D8 damage, but you escape his pursuit!",
              "damage": "1D8",
              "nextEntry": "293"
            }
          }
        }
      }
    ],
    "traceNumbers": ["230_guard_2_action", "230_guard_2_combat"]
  },
  "230_guard_3_combat": {
    "description": "The final guard has made his move to grab you. How will you respond?",
    "choices": [
      {
        "text": "Use the Karpathos Device to fight",
        "effects": {
          "check": {
            "skill": "Brawl",
            "success": "293",
            "failure": "574"
          }
        }
      },
      {
        "text": "Dodge the grab attempt",
        "effects": {
          "check": {
            "skill": "Dodge",
            "success": "293",
            "failure": "574"
          }
        }
      }
    ],
    "traceNumbers": ["230_guard_3_action"]
  },
  "230a": {
    "description": "The glass shatters loudly as you grab the Karpathos Device. It is surprisingly heavy. Unfortunately, the noise attracts immediate attention. Make a DEX check to see if you can escape before the guard unstraps his revolver and takes a shot at you.",
    "choices": [
      {
        "text": "Attempt to escape with the Device, make a DEX check.",
        "effects": {
          "check": {
            "skill": "DEX",
            "success": "230b",
            "failure": "230c"
          }
        }
      }
    ],
    "traceNumbers": ["280"]
  },
  "230b": {
    "description": "You sprint through the halls, evading the guard. As you turn a corner, you face the first of three more guards stationed in successive rooms.",
    "choices": [
      {
        "text": "Navigate past the first guard",
        "nextEntry": "230d"
      }
    ],
    "traceNumbers": ["230a"]
  },
  "230c": {
    "description": "The guard fires his revolver. Take 1D8 damage if he hits. If you survive, you must still try to escape through the museum.",
    "effects": {
      "health": {
        "diceRoll": "1D100",
        "success": "1D8",
        "failure": 0,
        "threshold": 25
      }
    },
    "choices": [
      {
        "text": "Continue to flee despite the injury.",
        "nextEntry": "230b"
      }
    ],
    "traceNumbers": ["230a"]
  },
  "230d": {
    "description": "You are now facing the first guard. Roll 1D6 to determine the guard's action.",
    "choices": [
      {
        "text": "Face the first guard",
        "nextEntry": "230_guard_1_action"
      }
    ],
    "traceNumbers": ["230b", "230c"]
  },
  "230e": {
    "description": "After dealing with the first guard, you now face the second guard.",
    "choices": [
      {
        "text": "Navigate past the second guard",
        "nextEntry": "230_guard_2_action"
      }
    ],
    "traceNumbers": ["230d", "230_guard_1_action"]
  },
  "230f": {
    "description": "Having navigated past the second guard, you now face the third and final guard.",
    "choices": [
      {
        "text": "Navigate past the final guard",
        "nextEntry": "230_guard_3_action"
      }
    ],
    "traceNumbers": ["230e", "230_guard_2_action"]
  },
  "249a": {
    "description": "The authorities are hot on your trail, your fate hangs in the balance.",
    "choices": [
      {
        "text": "Surrender to the police.",
        "nextEntry": "315"
      },
      {
        "text": "Resist arrest and try to escape.",
        "nextEntry": "249d"
      },
      {
        "text": "Attempt to destroy the Karpathos Device.",
        "nextEntry": "249b"
      }
    ],
    "traceNumbers": ["274", "293"]
  },
  "249b": {
    "description": "You find that the Device is impervious to your hasty assaults. But the Nile is only a few paces distant. You consider whether to throw it into the river to prevent its misuse.",
    "choices": [
      {
        "text": "Throw the Device into the Nile.",
        "nextEntry": "249c"
      },
      {
        "text": "Reconsider and surrender to the police.",
        "nextEntry": "315"
      }
    ],
    "traceNumbers": ["249a"]
  },
  "249c": {
    "description": "You steal a felucca and slowly drift downstream. Sometime later you judge it safe, and drop the heavy Device into the Nile itself, so that it will sink down into the deep silts that have lain there undisturbed for millennia. Later, the police find you and capture you. You serve seven years in an Egyptian prison, only to return home penniless, disgraced, and without home or friends. Your life is ruined, and until you die you never know whether you did the right thing in Cairo all those years before. But you did, of course. Well done! You saved the world. THE END.",
    "end": true,
    "traceNumbers": ["249b"]
  },
  "249d": {
    "description": "It doesn't take long for the police to surround you and reclaim the Karpathos Device. As for you, the police arrest you and you spend several years in prison, before being released and returned to America.",
    "choices": [
      {
        "text": "Reflect on your choices.",
        "nextEntry": "574"
      }
    ],
    "traceNumbers": ["249a"]
  },
  "263a": {
    "description": "You focus intently, trying to spot a safe path through the menacing shadows.",
    "choices": [
      {
        "text": "Make a Spot Hidden roll",
        "effects": {
          "check": {
            "skill": "Spot Hidden",
            "success": "263b",
            "failure": {
              "nextEntry": "263",
              "damage": 1,
              "message": "A mummy's hand brushes against you as you fail to notice a crucial detail!"
            }
          }
        }
      }
    ]
  },
  "263b": {
    "description": "Having spotted a possible path, you now need to dodge the groping hands of the undead.",
    "choices": [
      {
        "text": "Attempt to Dodge",
        "effects": {
          "check": {
            "skill": "Dodge",
            "success": "263c",
            "failure": {
              "nextEntry": "263",
              "damage": 1,
              "message": "You stumble as a hand clutches at your foot, causing minor injuries!"
            }
          }
        }
      }
    ]
  },
  "263c": {
    "description": "One last challenge: apply your intellect to find the safest exit route.",
    "choices": [
      {
        "text": "Use your intelligence",
        "effects": {
          "check": {
            "skill": "INT",
            "success": {
              "nextEntry": "274",
              "damage": "1D4+1",
              "message": "You hurl yourself through a plate glass window to escape, suffering cuts in the process."
            },
            "failure": {
              "nextEntry": "263",
              "damage": 1,
              "message": "A wrong turn! You're swiped by a clawed appendage as you miscalculate your route."
            }
          }
        }
      }
    ]
  },
  "585_exit": {
    "description": "You decide it's time to leave the hospital. Where to next?",
    "choices": [
      {
        "text": "Another Arkham Location",
        "requirements": {
          "currentLocale": "Arkham"
        },
        "nextEntry": "Arkham Location"
      },
      {
        "text": "Rest for the night",
        "effects": {
          "setHour": 23,
          "advanceTime": 6
        },
        "requirements": {
          "currentLocale": "Cunard Ship"
        },
        "nextEntry": "187"
      },
      {
        "text": "Another New York Location",
        "requirements": {
          "currentLocale": "New York"
        },
        "nextEntry": "New York Location"
      },
      {
        "text": "Another Athens Location",
        "requirements": {
          "currentLocale": "Athens"
        },
        "nextEntry": "Athens Location"
      },
      {
        "text": "Another Egypt Location",
        "requirements": {
          "currentLocale": "Egypt"
        },
        "nextEntry": "Egypt Location"
      },
      {
        "text": "Another Bremen Location",
        "requirements": {
          "currentLocale": "Bremen"
        },
        "nextEntry": "Bremen Location"
      },
      {
        "text": "Back to The Dark Sea",
        "requirements": {
          "currentLocale": "The Dark Sea"
        },
        "nextEntry": "480"
      },
      {
        "text": "Back to Antarctic Base Camp",
        "requirements": {
          "currentLocale": "Antarctic Base Camp"
        },
        "nextEntry": "520"
      }
    ]
  },
  "585a": {
    "description": "You feel much better but can still recover more.",
    "choices": [
      {
        "text": "Stay another day to regain 1 hit point (up to your normal maximum)",
        "requirements": {
          "notFullHealth": true,
          "notCurrentLocale": "Cunard Ship"
        },
        "nextEntry": "585a"
      },
      {
        "text": "Leave the hospital",
        "nextEntry": "585_exit"
      }
    ]
  },
  "585b": {
    "description": "Your condition is stable, but additional rest could help.",
    "choices": [
      {
        "text": "Stay another day to regain 1 hit point (up to your normal maximum)",
        "requirements": {
          "notFullHealth": true,
          "notCurrentLocale": "Cunard Ship"
        },
        "nextEntry": "585b"
      },
      {
        "text": "Leave the hospital",
        "nextEntry": "585_exit"
      }
    ]
  }
}
