{
  "13": {
    "title": "START",
    "description": "For you, Professor Louis Grunewald, this first day of September 1931 has been tiring and uncomfortable. Light mist has covered Arkham for most of the day. You held two uninspired undergraduate classes at Miskatonic University, and you met with the new chairman of the literature Department, a giddy Technocrat. You survey your desk and see that a stack of papers to grade has already formed. You’re enjoying your second pipe of the evening, and putting off grading papers, when the doorbell rings. To your surprise, it’s a telegraphic messenger.\n\n“It arrived at Kingspoint Head station not more than an hour ago,” the boy says.\n\nYou sign for it, and slip a dime into the youngster’s hand. “Oh, thank you, sir!” You open the envelope and scan the contents (Handout: Dark 1, see page 12).\n\nMy goodness, you think. Imagine! Dotty old Gliere in prison! You recall that he had gone to Greece to work on his book concerning primitive myths. What has he gotten himself into? Should you wire money? You recall all the amusing discussions you’ve had with him, and a sudden insight lets you understand that Tibor Gliere had no close friends except for you. Should you go help him? You suppose the University will grant you leave. But do you want to go?\n\nWith uncommon speed you decide to go to Athens to help Gliere. You write him a wire, and another to Ernest Holt, a wealthy New York financier and a good friend of yours. If you get into hot water, Holt will help, and so, you decide to keep him posted on your progress. You give both telegrams to the waiting messenger, along with the necessary funds.\n\nWhat to do now? You’ll go to the bank first thing in the morning to get travel funds. As for Trans-Atlantic schedules, well the Advertiser surely carries that information. As you pack, you wonder if you should check Gliere’s room at Mrs. Harding’s boarding house. Maybe you could get a clue about Gliere’s activities or a hint about his arrest.\n\nYour passport is in order; your clothes and sundries are packed. You’d best turn in. You’re going on a little trip. When you awake, it is Sept. 2; go to 102.",
    "choices": [{ "text": "Advance", "nextEntry": "102" }],
    "traceNumbers": ["START"]
  },
  "102": {
    "title": "GRUNEWALD'S HOME",
    "description": "If it is after 8 September, go to 147. If not, and if you’re Grunewald, you can rest and have a repast: go to any Arkham Location. If you’re not Grunewald, go to 120.",
    "choices": [
      {
        "text": "After 8 September",
        "nextEntry": "147",
        "requirements": { "dateAfter": "1931-09-08" }
      },
      {
        "text": "Rest and repast",
        "nextEntry": "Arkham Location",
        "requirements": { "character": "Professor Grunewald" }
      },
      {
        "text": "Not Grunewald",
        "nextEntry": "120",
        "requirements": { "characterNot": "Professor Grunewald" }
      }
    ],
    "traceNumbers": ["13"]
  },
  "60": {
    "title": "ARKHAM ADVERTISER",
    "description": "Information available by phone: for scheduled sailings of ocean liners, go to 136. For news of Athens, go to 80. For each hour spent browsing through the paper’s back-issue files, you can attempt one of the following rolls once:\n\n• For a successful Library Use roll, go to 48.\n• For a successful Spot Hidden roll, go to 125.\n• You may also attempt a Luck roll, if you succeed, go to 168.\n• If it is October or later, go to 172 as well.\n\nOnce finished at the newspaper, go to any Arkham Location.",
    "choices": [
      { "text": "Scheduled sailings of ocean liners", "nextEntry": "136" },
      { "text": "News of Athens", "nextEntry": "80" },
      { "text": "Library Use roll", "nextEntry": "48" },
      { "text": "Spot Hidden roll", "nextEntry": "125" },
      { "text": "Luck roll", "nextEntry": "168" },
      { "text": "October or later", "nextEntry": "172" },
      { "text": "Finish at newspaper", "nextEntry": "Arkham Location" }
    ],
    "traceNumbers": ["Arkham Location"]
  },
  "16": {
    "title": "ARKHAM DEPOT",
    "description": "If arriving in Arkham, go to any Arkham Location.\n\nIf heading to Boston, trains leave at 9am, noon, and 5pm. The trip takes an hour. You may wait for your train (on arrival in Boston, go to 64), or go to any other Arkham Location.",
    "choices": [
      { "text": "Arriving in Arkham", "nextEntry": "Arkham Location" },
      { "text": "Heading to Boston", "nextEntry": "64" },
      { "text": "Other Arkham Location", "nextEntry": "Arkham Location" }
    ],
    "traceNumbers": ["Arkham Location"]
  },
  "3": {
    "title": "ARKHAM FIRST NATIONAL BANK",
    "description": "Deposits and withdrawals are possible between 9-3. M-F. If you’re Prof. Grunewald, your account is here, and you can withdraw up to the Cash amount noted on the investigator sheet.\n\nGo to any Arkham Location.",
    "choices": [
      { "text": "Withdraw Cash", "nextEntry": "Arkham Location" },
      { "text": "Finish at bank", "nextEntry": "Arkham Location" }
    ],
    "traceNumbers": ["Arkham Location"]
  },
  "38": {
    "title": "RETAIL STORE",
    "description": "This retailer accepts currency from any country. You can buy most any item. You also can buy a hand-to-hand weapon or a handgun. Then go to any location on the appropriate location table:\n\n• Arkham Location Table.\n• New York Location Table.\n• Athens Location Table.\n• Egypt Location Table.\n• Bremen Location Table.",
    "choices": [
      { "text": "Buy item", "nextEntry": "Arkham Location" },
      { "text": "Buy weapon", "nextEntry": "Arkham Location" },
      { "text": "Finish shopping", "nextEntry": "Arkham Location" }
    ],
    "traceNumbers": ["Arkham Location"]
  },
  "593": {
    "title": "BEE'S DINER",
    "description": "A small diner offering basic meals. It's a place to sit down and have a meal while gathering your thoughts.\n\nGo to any Arkham Location.",
    "choices": [{ "text": "Finish meal", "nextEntry": "Arkham Location" }],
    "traceNumbers": ["Arkham Location"]
  },
  "113": {
    "title": "HARDING HOUSE",
    "description": "A boarding house where Tibor Gliere rented a room. You might find some clues here.\n\nIf you want to speak to the landlady, go to 45. If you want to try sneaking in later at night, go to 90.",
    "choices": [
      { "text": "Speak to the landlady", "nextEntry": "45" },
      { "text": "Sneak in later", "nextEntry": "90" }
    ],
    "traceNumbers": ["Arkham Location"]
  },
  "585": {
    "title": "HOSPITAL",
    "description": "The hospital is always open. You can receive treatment for injuries or illnesses here.\n\nGo to any Arkham Location.",
    "choices": [
      { "text": "Receive treatment", "nextEntry": "Arkham Location" },
      { "text": "Finish at hospital", "nextEntry": "Arkham Location" }
    ],
    "traceNumbers": ["Arkham Location"]
  },
  "82": {
    "title": "MISKATONIC UNIVERSITY",
    "description": "Information available by phone: the MU library is open 9am to 9pm, Mon-Sat.\n\n• To visit the library, go to 145.\n• To see Dr. Martin Fen, Chairman of the History Department—before or on 8 Sept., go to 122—after 8 Sept., go to 143.\n• To see the Dean—before or on Sept. 8, go to 100—after Sept. 8, go to 197.\n\nOnce finished in the library, go to any Arkham Location.",
    "choices": [
      { "text": "Visit the library", "nextEntry": "145" },
      { "text": "See Dr. Martin Fen (before 8 Sept.)", "nextEntry": "122" },
      { "text": "See Dr. Martin Fen (after 8 Sept.)", "nextEntry": "143" },
      { "text": "See the Dean (before 8 Sept.)", "nextEntry": "100" },
      { "text": "See the Dean (after 8 Sept.)", "nextEntry": "197" },
      { "text": "Finish at university", "nextEntry": "Arkham Location" }
    ],
    "traceNumbers": ["Arkham Location"]
  }
}
